[{"title": "Content-Oblivious Trust and Safety Techniques: Results from a Survey of Online Service Providers", "abstract": "Riana Pfefferkorn, research scholar at the Stanford Internet Observatory, describes a survey of online service providers regarding their online trust and safety techniques. She concludes that content-dependent techniques are not a “silver bullet against abuse” and that any marginal inhibiting effect of using end-to-end encryption will vary by abuse type. Instead, she encourages greater consideration of what she calls “content-oblivious” techniques in the ongoing policy debate regarding providers’ anti-abuse obligations and their use of end-to-end encryption.", "publisher": "SSRN Electronic Journal", "date": null, "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3920031", "authors": ["Pfefferkorn, Riana"], "tags": ["2020s", "Content Detection", "End-to-End Encryption", "Online Abuse", "Online Safety", "Stanford Internet Observatory"], "slug": "content-oblivious-trust-and-safety-techniques-resu-bd3a0a7e"}, {"title": "The EARN IT Act Is Unconstitutional: Fourth Amendment", "abstract": "This blog post outlines the argument that proposed legislation entitled the EARN IT Act is unconstitutional on Fourth Amendment Grounds. The Post argues that the Act would require online service providers to actively scan for Child Sexual Abuse Materials, rather than merely reporting it when it is found. By requiring providers to conduct these searches, the providers would become state actors and the searches would require a warrant, and without a warrant, these searches would be unconstitutional under the fourth amendment, and the evidence would be excluded in court proceedings. The post discusses previous child abuse sexual material reporting laws details court cases that have discusses state actor status, and ultimately argues that the law would violate the Fourth Amendment.", "publisher": "The Center for Internet and Society at Stanford Law School", "date": "March 2020", "url": "http://cyberlaw.stanford.edu/blog/2020/03/earn-it-act-unconstitutional-fourth-amendment", "authors": ["Pfefferkorn, Riana"], "tags": ["2020s", "Stanford CIS", "US Congress"], "slug": "the-earn-it-act-is-unconstitutional-fourth-amendme-a7207348"}, {"title": "Keys Under Doormats: Mandating Insecurity by Requiring Government Access to All Data and Communications", "abstract": "On July 7, 2015, a group of computer scientists and security experts published a study to ascertain the likely effects of renewed attempts to mandate back doors of all data for law enforcement. Twenty years ago the same debate occurred and was abandoned. In the interim, “law enforcement agencies found new and more effective means of accessing vastly larger quantities of data.” The group “found that the damage that could be caused by law enforcement exceptional access requirements would be even greater today than it would have been 20 years ago.” The group also found that “any proposals that alter the security dynamics online should be approached with caution”, that “new law enforcement requirements are likely to introduce unanticipated, hard to detect security flaws”, and that “the prospect of globally deployed exceptional access systems raises difficult problems about how such an environment would be governed and how to ensure that such systems would respect human rights and the rule of law.”", "publisher": null, "date": "July 2015", "url": "https://dspace.mit.edu/bitstream/handle/1721.1/97690/MIT-CSAIL-TR-2015-026.pdf", "authors": ["Abelson, Harold and Anderson, Ross and Bellovin, Steven M and Benaloh, Josh and Blaze, Matt and Diffie, Whitﬁeld and Gilmore, John and Green, Matthew and Landau, Susan and Neumann, Peter G and Rivest, Ronald L and Schiller, Jeﬀrey I and Schneier, Bruce and Specter, Michael and Weitzner, Daniel J"], "tags": ["2010s", "Backdoors", "Keys"], "slug": "keys-under-doormats-mandating-insecurity-by-requir-5df4f072"}, {"title": "Crypto Summit 2.0 Outcomes Report Track 1", "abstract": "AccessNow published a summary of the Crypto Summit 2.0, the second of two summits, which occurred on March 30, 2016 in Silicon Valley. The goal of this conference was to build off the key questions identified in Crypto Summit 1.0. The group identified four policy tracks to focus on in the second summit. The first policy track entails the “roles and responsibilities in an encrypted world”. This was defined as “the rumored, public, or potential methods and tools that are available to government surveillance agencies; where and how they are explicitly authorized; their costs and benefits; and high-level safeguards that need to be in place if they are carried out.” The group was able to identify “24 techniques or alternatives [for government] to obtain encrypted data”, and “14 factors by which to consider alternate techniques to obtain encrypted data.” The group identified future work as “comparing all 14 factors to all 24 techniques, and ranking these techniques” and holding a “[f]urther discussion to examine appropriate disclosure and transparency standards.”", "publisher": null, "date": "March 2016", "url": "https://www.accessnow.org/cms/assets/uploads/2016/07/CS2.0_Outcomes_Track1.pdf", "authors": [], "tags": ["2010s", "Access Now", "Crypto Summit", "Primer"], "slug": "crypto-summit-2-0-outcomes-report-track-1-f3204001"}, {"title": "Crypto Summit 2.0 Outcomes Report Track 2", "abstract": "The “CryptoMap” is an interactive digital map project, conducted by the Center for Education and Research in Innovation (CEPI) at Fundação Getulio Vargas São Paulo Law School (FGV Direito SP), in Brazil, that seeks to map the international debate on encryption regulation. Each of the 40 countries on the map features a clickable “CryptoPedia” entry (a short summary of the country’s encryption policies), alongside an access link to a “Descriptive Pill,” which describes the country’s domestic privacy policies, encryption regulations, and the government’s access to encrypted data in greater detail. The information in each of the “Descriptive Pills” is based on research gathered by CEPI between 2017 and 2018. According to CEPI, the overarching goal of the project was “to identify trends and regulatory models related to encryption around the world and to offer an initial set of sources for those interested in the subject and/or interested in developing further research on the topic.”", "publisher": "CryptoMap", "date": null, "url": "http://www.fgv.br/direitosp/cryptomap/eng/#home", "authors": ["Augusto Liguori Filho, Carlos and Kenzo dos Santos, Guilherme and Favaretto Salvador, João Pedro and Guimarães, Tatiane B."], "tags": ["Global", "Graphic", "Interactive", "Map"], "slug": "crypto-summit-2-0-outcomes-report-track-2-d37df90e"}, {"title": "Bernstein v. US Dept. of State, 974 F. Supp. 1288 (N.D. Cal. 1997)", "abstract": "Bernstein v. US Dept. of State, 974 F. Supp. 1288 (N.D. Cal. 1997) case opinion from the US District Court for the Northern District of California", "publisher": null, "date": null, "url": "https://law.justia.com/cases/federal/district-courts/FSupp/974/1288/1451176/", "authors": [], "tags": [], "slug": "bernstein-v-us-dept-of-state-974-f-supp-1288-n-d-c-60eae534"}, {"title": "Bernstein v. US Dept. of State, 945 F. Supp. 1279 (N.D. Cal. 1996)", "abstract": "Bernstein v. US Dept. of State, 945 F. Supp. 1279 (N.D. Cal. 1996) case opinion from the US District Court for the Northern District of California", "publisher": null, "date": null, "url": "https://law.justia.com/cases/federal/district-courts/FSupp/945/1279/1457799/", "authors": [], "tags": [], "slug": "bernstein-v-us-dept-of-state-945-f-supp-1279-n-d-c-1b4aef36"}, {"title": "Bernstein v. US Dept. of State, 922 F. Supp. 1426 (N.D. Cal. 1996)", "abstract": null, "publisher": null, "date": null, "url": "https://law.justia.com/cases/federal/district-courts/FSupp/922/1426/1592613/", "authors": [], "tags": [], "slug": "bernstein-v-us-dept-of-state-922-f-supp-1426-n-d-c-bfdb8533"}, {"title": "Travel Guide to the Digital World: Encryption Policy for Human Rights Defenders", "abstract": "This is a guide, aimed at a non-technical audience, seeking to explain the connection between human rights and encryption. The article gives a background on the basics of encryption, and how it affects the day-to-day life of people around the globe, and its impacts on privacy and freedom of expression. Finally, the article outlines the legal and policy background of encryption regulation across the globe and at the international, national, and local levels. This guide provides a simple but detailed background on global encryption policy and its direct impacts on human rights.\n\nLinks to accompanying podcast miniseries also attached.", "publisher": null, "date": "2017", "url": "https://www.gp-digital.org/publication/travel-guide-to-the-digital-world-4-encryption-policy-for-human-rights-defenders/", "authors": ["Global Partners Digital", "Stepanovich, Amie", "Wingfield, Richard"], "tags": ["2010s", "Five Eyes", "G20", "Human Rights", "International", "Organisation for Economic Cooperation and Development"], "slug": "travel-guide-to-the-digital-world-encryption-polic-d0a50ee7"}, {"title": "Compliance with Court Orders Act of 2016 - Draft", "abstract": null, "publisher": null, "date": null, "url": "https://www.feinstein.senate.gov/public/index.cfm/2016/4/intelligence-committee-leaders-release-discussion-draft-of-encryption-legislation", "authors": ["Burr, Richard", "Feinstein, Dianne"], "tags": ["2010s", "Compliance with Court Orders Act", "Criminal Law", "Government Access", "Terrorism", "US Congress"], "slug": "compliance-with-court-orders-act-of-2016-draft-517e2d28"}, {"title": "The Last Refuge of the Criminal: Encrypted Smartphones", "abstract": "Catherine de Bolle and Cyrus R. Vance, Jr., write in Politico that encrypted devices—particularly encrypted smartphones—pose an intolerable impediment to law enforcement, the pursuit of justice, and vindication of victims and their families. They argue that criminals exploit unregulated encryption to perpetrate a variety of crimes, from ransomware to child sex trafficking, and that the ability to lawfully access devices is overwhelmingly frustrated by judges, policies, and budgets. In light of this crisis, they call on lawmakers to develop regulation that better balances privacy and public safety.", "publisher": "Politico", "date": "July 2021", "url": "https://www.politico.eu/article/the-last-refuge-of-the-criminal-encrypted-smartphones-data-privacy/", "authors": ["de Bolle, Catherine", "Vance, Cyrus R., Jr."], "tags": ["2020s", "Criminal Law", "Lawful Access", "Regulated Encryption"], "slug": "the-last-refuge-of-the-criminal-encrypted-smartpho-ba7ee311"}, {"title": "We Need More Protection from Government Surveillance — Not Less", "abstract": "A group of user- and human-rights advocates jointly write an article published by Politico in response to Catherine de Bolle and Cyrus R. Vance, Jr.s, \"The Last Refuge of the Criminal: Encypted Smartphones.\" They describe the importance of encryption to democracy and human rights in the face of increasing pressure by government for tech-company-assisted surveillance, citing multiple groups that depend upon encryption for privacy and physical safety: from investigative journalists to subjects of authoritarian governments to members of the LGBTQ+ community. They argue that encryption is, by definition, binary, that “regulated encryption” is a euphemism for backdoors—and, fundamentally, that encryption is sorely needed as a basic protection around the globe.", "publisher": "Politico", "date": "July 2021", "url": "https://www.politico.eu/article/we-need-more-protection-government-surveillance-not-less/", "authors": ["McGowan, Iverna", "Naranjo, Diego", "Koomen, Maria", "Beltrà, Guillermo", "Preiss, Omri", "Massé, Estelle", "Cohn, Cindy", "Stollmeyer, Alice", "Bukovská, Barbora", "Dusepulchre, Gaelle", "Anderson, Andrew", "Skoric, Vanja", "Westby, Joe", "Keller, Paul"], "tags": ["2020s", "Backdoors", "Human Rights", "Regulated Encryption"], "slug": "we-need-more-protection-from-government-surveillan-33e5e137"}, {"title": "The Law and Policy of Client-Side Scanning", "abstract": "Paul Rosenzweig, former Deputy Assistant Secretary for Policy in the Department of Homeland Security, and founder of a homeland security consulting company, writes an analysis of client-side scanning published by the Lawfare Institute in cooperation with the Brookings Institute. He concludes that, while client-side scanning offers attractive protective capabilities to meet the rise of online-distributed child pornography via encrypted systems, its adoption at its current nascent stage would be nonetheless undesirable due to technological, legal, and policy uncertainties.", "publisher": "Lawfare", "date": "August 2020", "url": "https://www.lawfareblog.com/law-and-policy-client-side-scanning", "authors": ["Rosenzweig, Paul"], "tags": ["2020s", "Client-Side Scanning", "Content Detection", "Online Abuse", "Online Safety"], "slug": "the-law-and-policy-of-client-side-scanning-7598c301"}, {"title": "Outside Looking In: Approaches to Content Moderation in End-to-End Encrypted Systems", "abstract": "A group of researchers at the Center for Technology and Democracy orient the ongoing content moderation/end-to-end-encryption debate within the history of the Crypto Wars and analyze the strength of central competing claims. Content detection, and the obstacle of end-to-end-encryption, is only the latest permutation in the ongoing dialogue between law enforcement investigative capabilities and competing values including privacy, freedom of expression, and secure ecommerce. The authors investigate the degree of impact of end-to-end-encryption upon content moderation efforts, and conclude that, of the available methods of content detection in end-to-end-encrypted systems, “technical approaches for user-reporting and meta-data analysis” best support law enforcement while protecting user privacy and security.", "publisher": null, "date": "August 2021", "url": "https://cdt.org/insights/outside-looking-in-approaches-to-content-moderation-in-end-to-end-encrypted-systems/", "authors": ["Kamara, Seny", "Knodel, Mallory", "Llansó, Emma", "Nojeim, Greg", "Qin, Lucy", "Thakur, Dhanaraj", "Vogus, Caitlin"], "tags": ["2020s", "Center for Democracy and Technology", "Content Detection", "End-to-End Encryption", "Online Abuse"], "slug": "outside-looking-in-approaches-to-content-moderatio-3fcad0c7"}, {"title": "Symposium: Recent Development: Key Escrow Encryption Policies and Technoligies", "abstract": "This article from 1996 details the Clinton Administration’s key escrow proposal, outlines the positions around key escrow, international approaches to key escrow, and argues that key escrow is an effective solution that should be implemented. The article argues that key escrow assists law enforcement, protects businesses, would put the US in line with other nations, and can be securely implemented in up to 64 bit encryption. However, the article notes that criminals may be able to skirt the rules, but hopes that the rules would positively influence markets.", "publisher": "Villanova Law Review", "date": "1996", "url": "https://advance-lexis-com.colorado.idm.oclc.org/document/teaserdocument/?pdmfid=1516831&crid=8b6ba342-19bb-468d-ba50-25b58114a8ae&pddocfullpath=%2Fshared%2Fdocument%2Fanalytical-materials%2Furn%3AcontentItem%3A3S3V-6N10-00CT-V0F6-00000-00&pddocid=urn%3AcontentItem%3A3S3V-6N10-00CT-V0F6-00000-00&pdcontentcomponentid=139228&pdteaserkey=h1&pditab=allpods&ecomp=sp79k&earg=sr0&prid=045f1ac9-dc07-4c8a-abad-d37187cd5523", "authors": ["Denning, Dorothy E. and Baugh, Jr., William E."], "tags": ["1990s", "Crypto Wars", "Crypto Wars I", "Government Policy", "Key Escrow"], "slug": "symposium-recent-development-key-escrow-encryption-7ab38e95"}, {"title": "Submission of the Citizen Lab (Munk School of Global Affairs, University of Toronto) to the United Nations Special Rapporteur on Violence Against Women, Its Causes and Consequences, Ms. Dubravka Šimonović", "abstract": "This report, submitted to the o the United Nations Special Rapporteur on violence against women, details how gender-based violence can be perpetrated through technology and how encryption should be part of the solution to prevent such violence. The report offers case studies of gendered violence in Canada and proposes solutions. Among those solutions, encryption can offer privacy and anonymity to victims, as well as advocates. Finally, the paper offers a policy and legal framework to implement its proposed solutions.", "publisher": null, "date": "November 2017", "url": "https://citizenlab.ca/wp-content/uploads/2017/11/Final-UNSRVAG-CitizenLab.pdf", "authors": [], "tags": ["2010s", "CA", "Human Rights"], "slug": "submission-of-the-citizen-lab-munk-school-of-globa-8208d51f"}, {"title": "Statement of Cindy A. Cohn, Testimony on Encryption as Constitutionally Protected Speech", "abstract": "This testimony from by Cindy A. Cohn, Lead Counsel in the Bernstein v. Department of Justice, before the Senate Judiciary Committee's Subcommittee on Constitution, Federalism and Property Rights, discusses the Bernstein v. Department of Justice litigation, other similar cases, and their potential impacts. The case centered around First Amendment concerns in encryption, and the testimony emphasizes encryption’s impact on free expression and communication.", "publisher": "Gifts of Speech", "date": "March 1998", "url": "http://gos.sbc.edu/c/cohn.html", "authors": ["Cindy A. Cohn"], "tags": ["1990s", "Crypto Wars I"], "slug": "statement-of-cindy-a-cohn-testimony-on-encryption-5ab3bf4f"}, {"title": "SS7 Hack Explained: What Can You Do About It?", "abstract": "This article explains the SS7 hack—which allowed hackers to listen to phone calls, read texts, and track mobile phones—recounts what lead to the hack, and gives solutions for people to protect their data. The article, geared towards a law audience, explains how systems can be hacked and what can be done about it, both by a consumer and by companies and the government.", "publisher": "The Guardian", "date": "April 2016", "url": "https://www.theguardian.com/technology/2016/apr/19/ss7-hack-explained-mobile-phone-vulnerability-snooping-texts-calls", "authors": ["Gibbs, Samuel"], "tags": ["2020s", "Data and Computer Security", "Hacking", "Mobile", "SS7", "Surveillance", "Telecoms", "World News"], "slug": "ss7-hack-explained-what-can-you-do-about-it-2ca330ad"}, {"title": "Sources: We Were Pressured to Weaken the Mobile Security in the 80's", "abstract": "This article details how the A5/1-encryption standard, used to secure mobile phones, was made intentionally weaker than it could have been. Four men involved with the invention of the encryption standard detailed the political agreements that lead to the standard being weaker than technologically possible, as the encryption standard had been made 54 bit, rather than 128 bit. This encryption standard, they argued, could have at least delayed NSA hacking of the encryption.", "publisher": "Aftenposten", "date": "January 2014", "url": "https://www.aftenposten.no/article/ap-Olkl.html", "authors": ["Færaas, Arild"], "tags": ["1980s", "GSM", "Global", "Mobile", "NSA"], "slug": "sources-we-were-pressured-to-weaken-the-mobile-sec-d482f436"}, {"title": "Software Firms Call U.S. Plan on Encryption 'Unworkable'", "abstract": "This article details the Business Software Alliance, a software industry group, and its rejection of Clinton Administration export controls as unworkable. This disagreement presented a large roadblock to discussions between industry and government", "publisher": "Washington Post", "date": "December 1996", "url": null, "authors": ["Chandrasekaran, Rajiv"], "tags": ["1990s", "Clinton", "Export Controls"], "slug": "software-firms-call-u-s-plan-on-encryption-unworka-5550f1d3"}, {"title": "Security, Surveillance And The Truth About Going Dark", "abstract": "This article details a meeting among government officials on whether to ban the public availability and explores similar proposals from the past. The article details how encryption policy frequently debates back doors and the balance between security and surveillance. The article argues that as surveillance technology becomes increasingly prevalent, security must be prioritized.", "publisher": "Forbes", "date": "July 2019", "url": "https://www.forbes.com/sites/forbestechcouncil/2019/07/25/security-surveillance-and-the-truth-about-going-dark/", "authors": ["Blech, Richard"], "tags": ["2010s", "Going Dark"], "slug": "security-surveillance-and-the-truth-about-going-da-639358d3"}, {"title": "Security Win: Burr-Feinstein Proposal Declared “Dead” for This Year", "abstract": "This post from the Electronic Frontier Foundation details how proposed legislation from Senators Burr and Feinstein was not going to be introduced, which was seen as a win by many privacy advocates. The article explains the proposal, which would mandate backdoors, and then describes that although it would not advance, many others like it were still being proposed or debated.", "publisher": "Electronic Frontier Foundation", "date": "May 2016", "url": "https://www.eff.org/deeplinks/2016/05/win-one-security-burr-feinstein-proposal-declared-dead-year", "authors": ["Reitman, rainey"], "tags": ["2010s", "Going Dark", "Law Enforcement"], "slug": "security-win-burr-feinstein-proposal-declared-dead-728401be"}, {"title": "Security “Front Doors” vs. “Back Doors”: A Distinction Without a Difference", "abstract": "This article by Jeffrey Vagle and Matt Blaze discusses FBI Director James Comey’s speeches calling for back doors in encryption for law enforcement and argues that it is technologically infeasible and politically wise. The article details how back doors will eventually be uncovered and lead to vulnerabilities in systems. Finally, the article argues that the language being used to advocate for back doors builds a false sense of security in populations unfamiliar with the technological realities and leads people away from more workable solutions.", "publisher": "Just Security", "date": "October 2014", "url": "https://www.justsecurity.org/16503/security-front-doors-vs-back-doors-distinction-difference/", "authors": ["Jeffrey Vagle", "Matt Blaze"], "tags": ["2010s", "Backdoors", "Backdoors-Feasibility", "Clipper Chip", "Golden Key", "James Comey", "Law Enforcement", "Mobile"], "slug": "security-front-doors-vs-back-doors-a-distinction-w-27fb709b"}, {"title": "Rethinking Encryption", "abstract": "This article written by Jim Baker encourages law enforcement officials in the U.S. to embrace encryption due to cybersecurity threats, particularly from china. The article begins by describing the issues of going dark to law enforcement, and quotes officials such as Attorney General William Barr encouraging Congress to legislate around encryption. However, because Congress has failed to act in light of such pressures, it is possible action will never occur. Then, addressing threats to national security will be necessary by other means. After describing national security threats from cyberattacks, potential Chinese interests in cyber-attacks, and the global zero-trust network, it will be necessary to build in security. Therefore, the FBI and other law enforcement officials should embrace encryption to safeguard American cyber infrastructure.", "publisher": "Lawfare", "date": "October 2019", "url": "https://www.lawfareblog.com/rethinking-encryption", "authors": ["Baker, Jim"], "tags": ["2010", "Amendment IV", "Attorney General William P. Barr", "CLOUD Act", "Cybersecurity", "Going Dark", "Law Enforcement", "Public Safety"], "slug": "rethinking-encryption-b0065e9b"}, {"title": "Worried about Apple? California Has a Bill That Would Disable Encryption on All Phones", "abstract": "This article from the Electronic Frontier Foundation discusses a bill proposed in the California state legislature that would require smartphones sold in the state to be capable of being decrypted by the manufacturer. The article discusses the concurrent Apple court case seeking decryption, and other similar legislation being proposed at the state and federal levels. The article argues that such measures are likely unconstitutional, but that they are also ineffective and impractical.", "publisher": "Electronic Frontier Foundation", "date": "March 2016", "url": "https://www.eff.org/deeplinks/2016/03/worried-about-apple-california-has-bill-would-disable-encryption-all-phones", "authors": ["Andrew Crocker"], "tags": ["2010s", "Encryption Ban", "State Law"], "slug": "worried-about-apple-california-has-a-bill-that-wou-8a2f438c"}, {"title": "World Map of Encryption Laws and Policies", "abstract": "This interactive map provides an overview of encryption laws throughout the world. The law categorized nations by minimal, some, and widespread restrictions, as well as imposing filters based on specific law or policy measures.", "publisher": null, "date": null, "url": "https://www.gp-digital.org/world-map-of-encryption/", "authors": ["Global Partners Digital"], "tags": ["Global", "Graphic", "Interactive", "Map"], "slug": "world-map-of-encryption-laws-and-policies-af6d8b94"}, {"title": "Wiretapping and Cryptography Today", "abstract": "This blog post from Matt Blaze examines the 2011 Wiretap report and argues that encryption has done little to hinder law enforcement. The blog post points out that despite the increased prevalence of encryption, few wiretap searches by law enforcement even encountered encryption, and never did it interfere with the investigation. The proposes that with the increased prevalence of encryption, law enforcement methods have adapted. Furthermore, Blaze gives examples and argues that encryption works at a wholesale level, but does not prevent targeted investigation.", "publisher": null, "date": "July 2011", "url": "https://web.archive.org/web/20110715210433/http://www.crypto.com/blog/wiretap2010", "authors": ["Matt Blaze"], "tags": ["2010s", "Crypto Wars", "Crypto Wars I", "Wiretap"], "slug": "wiretapping-and-cryptography-today-02c48835"}, {"title": "Who Holds the Key? – A Comparative Study of US and European Encryption Policies", "abstract": "This paper from 2000 by Sarah Andrews details the arguments for and against the use of encryption. In favor of encryption, the paper discusses the increased need for assurances of confidentiality in email and internet communication, as well as fraud. Against its use, the article discusses hindrances to law enforcement and the concealment of crimes. Finally, this article looks at the competing approaches of regulators in the U.S., U.K., and Europe.", "publisher": null, "date": "June 2000", "url": "https://warwick.ac.uk/fac/soc/law/elj/jilt/2000_2/andrews/", "authors": ["Sarah Andrews"], "tags": ["2000s", "E-Commerce", "EPIC", "Europe", "Human Rights"], "slug": "who-holds-the-key-a-comparative-study-of-us-and-eu-1cf69bed"}, {"title": "What is the Wassenaar Arrangement?", "abstract": "This brief explainer provides a background on the Wassenaar Arrangement, an arrangement from 1996 between 33 nations seeking to create consistent and transparent policy on encryption and to promote security.", "publisher": "Wassenaar Arrangement", "date": "February 2020", "url": "https://www.wassenaar.org/the-wassenaar-arrangement/", "authors": [], "tags": ["1990s", "Export Controls", "International / National Security", "Wassenar Arrangement"], "slug": "what-is-the-wassenaar-arrangement-e44b92a7"}, {"title": "Wassenaar Arrangement on Export Controls for Conventional Arms and Dual-Use Goods and Technologies", "abstract": "The Wassenaar Arrangement, an arrangement from 1996 between 33 nations seeking to create consistent and transparent policy on encryption, and to promote security. This document contains the declarations, guidelines, and procedures that governed the agreement. It provides detail and specifics on the functioning of the arrangement.", "publisher": "Wassenaar Arrangement Secretariat", "date": "December 1995", "url": null, "authors": [], "tags": ["1990s", "Dual-Use Technology", "Export Controls", "International / National Security", "Wassenar Arrangement"], "slug": "wassenaar-arrangement-on-export-controls-for-conve-7584af0f"}, {"title": "US Government Fines Intel's Wind River Over Crypto Exports", "abstract": "This article by John Leyden discussed a \\$750,000 fine by the Department of Commerce on Wind River for exporting products utilizing encryption to foreign nations, including China, Russia, and Israel.  The article explores increasing action by regulators, viewing large fines for violations as the norm going forward, in the conflict over foreign control over encryption. The article explores the consequences of escalating enforcement action over the trade of encrypted technology with foreign nations.", "publisher": "The Register", "date": "October 2014", "url": "https://www.theregister.co.uk/2014/10/17/intel_subsidiary_crypto_export_fine/", "authors": ["Leyden, John"], "tags": ["2010s", "Export Controls", "National Security"], "slug": "us-government-fines-intel-s-wind-river-over-crypto-09cbe60a"}, {"title": "U.S. Tries to Make It Easier to Wiretap the Internet", "abstract": "This New York Times article by Charlie Savage reports on planned legislation by the Obama administration which would allow for the US government to decrypt select communications and prevent going dark. The article discusses how encryption has worked in recent law enforcement investigations, and why the government finds such a technology necessary. The article discusses the feasibility of different possible elements of the proposed law, including attempting to regulate encryption technology coming from abroad. Finally, the article includes many quotes from experts warning about the potential fallacies and overbreadth of mandatory decryption.", "publisher": "The New York Times", "date": "September 2010", "url": "https://www.nytimes.com/2010/09/27/us/27wiretap.html", "authors": ["Savage, Charlie"], "tags": ["2010s", "CALEA", "Going Dark", "Government Access", "Mobile", "Surveillance"], "slug": "u-s-tries-to-make-it-easier-to-wiretap-the-interne-7c6b8243"}, {"title": "U.S. Supercomputer Export Control Policy", "abstract": "This hearing is from the House of Representatives Committee on National Security, in their 1997 hearing on U.S. Supercomputer Export Control Policy. Here, many high-level government officials are questioned on the details of encryption export policy. It gives a thorough accounting of the attitudes of the government officials involved in encryption policy in the 1990s.", "publisher": null, "date": "November 1997", "url": "http://commdocs.house.gov/committees/security/has317000.000/has317000_1.HTM", "authors": [], "tags": ["1990s", "Crypto Wars", "Crypto Wars I", "Export Controls", "Hearing", "National Security"], "slug": "u-s-supercomputer-export-control-policy-9f12a98a"}, {"title": "U.S. Says It Has Unlocked iPhone Without Apple", "abstract": "This New York Times article by Katie Benner and Eric Lichtblau reports on the government's successful unlocking of the iPhone of the suspect in the San Bernardino mass shooting, the investigation which gave rise to the Apple vs. FBI court case. The article reports on how the successful unlocking may lead Apple to request information about the exploited vulnerability in order to fix it. Furthermore, while the unlocking did not solve the underlying tensions between the makers of encrypted technology and law enforcement, it may be a method that law enforcement attempts when they are unable to access encrypted technology.", "publisher": "The New York Times", "date": "March 2016", "url": "https://www.nytimes.com/2016/03/29/technology/apple-iphone-fbi-justice-department-case.html", "authors": ["Benner, Katie and Lichtblau, Eric"], "tags": ["2010s", "Apple", "San Bernardino", "iPhone"], "slug": "u-s-says-it-has-unlocked-iphone-without-apple-c5d963b4"}, {"title": "U.S. Relaxes Export Controls on Supercomputers", "abstract": "This news article details a loosening of export restrictions on supercomputers to various nations on national security and economic grounds that had been tightened several years prior. The article details the process and substance of the loosened restrictions, as well as the political hurdles that had delayed the changes.", "publisher": "Arms Control Today", "date": "July 1999", "url": "https://www.armscontrol.org/act/1999-07/press-releases/us-relaxes-export-controls-supercomputers", "authors": ["Diamond, Howard"], "tags": ["1990s", "Clinton", "Export Controls"], "slug": "u-s-relaxes-export-controls-on-supercomputers-a6ca258e"}, {"title": "Timeline: The U.S. Government and Cybersecurity", "abstract": "This article offers a short timeline of government actions to curb the hacking of government computer systems. This article was prescient given the panic the Y2K bug that was creating in the vulnerabilities of government systems.", "publisher": "Washington Post", "date": "May 2003", "url": "https://www.washingtonpost.com/wp-dyn/articles/A50606-2002Jun26.html", "authors": [], "tags": ["1970s", "1980s", "1990s", "2000s", "Government Policy", "Primer"], "slug": "timeline-the-u-s-government-and-cybersecurity-5f7be48e"}, {"title": "The Way Forward: Working Together to Tackle Cybercrime", "abstract": "These remarks, given by Cristopher Wray, former director of the FBI at the 2019 FBI International Conference on Cyber Security, offer an insight into the goals and capabilities of the FBI. Director Wray describes the capabilities of the FBI to combat cybersecurity, the dangers of foreign influence, and the foreign development of cyber technology. Then, Director Wray argues how encryption impedes law enforcement, describes specific crimes where encrypted information hindered an FBI investigation, and argues that lawful access to encrypted materials is increasingly necessary to law enforcement investigations.", "publisher": null, "date": "July 2019", "url": "https://www.fbi.gov/news/speeches/the-way-forward-working-together-to-tackle-cybercrime", "authors": ["Wray, Christopher"], "tags": ["2010s", "FBI", "Law Enforcement", "User-Controller Encryption"], "slug": "the-way-forward-working-together-to-tackle-cybercr-9b44953b"}, {"title": "The Shifting Landscape of Global Internet Censorship", "abstract": "The 2017 Shifting Landscape of Global Internet Censorship by the Berkman Klein Center for Internet \\& Society is the 2017 update to their report which studies Internet censorship in 75 countries. The study looks at the filtering of documents and information, both in terms of specific topics or individuals as well as entire platforms. Furthermore, the study addresses both how platforms preventing selective filtering can lead to broader censorship of an entire platform, and how encrypted communications can lead to the filtering or blocking of entire platforms. The study looks at the increasingly complex technical landscape that has lead to increasingly complex and broad government censorship.", "publisher": null, "date": "2017", "url": "https://www.ssrn.com/abstract=2993485", "authors": ["Zittrain, Jonathan L. and Faris, Robert and Noman, Helmi and Clark, Justin and Tilton, Casey and Morrison-Westphal, Ryan"], "tags": ["2010s", "Censorship", "Global"], "slug": "the-shifting-landscape-of-global-internet-censorsh-92d9e491"}, {"title": "Press Release: The Search for Quantum-Resistant Cryptography: Understanding the Future Landscape", "abstract": "This press release by Sectigo, a commercial Certificate Authority, describes Sectigo's release of educational materials that describe how developments in quantum computing could render modern encryption ineffective. The materials describe the necessity for quantum-resistant cryptography, the capabilities such technology must possess, and the efforts to develop quantum-resistant algorithms.", "publisher": "Sectigo", "date": "September 2019", "url": "https://sectigo.com/newsroom/the-search-for-quantum-resistant-cryptography-understanding-the-future-landscape", "authors": [], "tags": ["2010s", "Quantum", "Quantum Resistant"], "slug": "press-release-the-search-for-quantum-resistant-cry-90e3d809"}, {"title": "The Risks of Key Recovery, Key Escrow, and Trusted Third-Party Encryption (Revised)", "abstract": "This report offers a detailed technical evaluation of the technical risks, costs, and policy implications of allowing government access to encryption keys. The article begins with the proposals that would benefit law enforcement officials, and the possibly insurmountable barriers to building such a system, and the details of the security risks and costs of such a system. Next, the report contemplates a variety of possibilities in building a system that allows government access and details the challenges that any system would present. This article thoroughly evaluates all possible technical solutions to allow government access to encryption keys and the technical barriers that make them an infeasible solution to problems with encryption.", "publisher": null, "date": "1998", "url": "https://www.schneier.com/academic/archives/1997/04/the_risks_of_key_rec.html", "authors": ["Abelson, H. and Anderson, R. and Bellovin, S.M. and Benaloh, J. and Blaze, M. and Diffie, W. and Gilmore, J. and Neumann, P.G. and Rivest, R.L. and Schiller, J.I. and Schneier, B."], "tags": ["1990s", "Crypto Wars", "Crypto Wars I", "Key Escrow", "Key Recovery"], "slug": "the-risks-of-key-recovery-key-escrow-and-trusted-t-50dad67f"}, {"title": "The Risks of “Responsible Encryption”", "abstract": "The Risks of “Responsible Encryption” critiques “responsible encryption,” a term developed used by US law enforcement officials describing a general policy of government access to encrypted materials. The article begins by detailing the origins of the terms and their use by government officials, then seeks to define the scope of the term and possible technical definitions. Next, the paper warns of the risks of exceptional access, including increased key usage and access, authentication of exceptional access requests at scale, the economic and competitive effects on US technology companies, and the limitations of exceptional access capabilities. Finally, the paper discusses the benefits and limitations of alternatives to “responsible encryption.”", "publisher": null, "date": "February 2018", "url": null, "authors": ["Pfefferkorn, Riana"], "tags": ["2010s", "Exceptional Access", "Government Access", "Law Enforcement", "Responsible Encryption", "Stanford CIS"], "slug": "the-risks-of-responsible-encryption-149c012c"}, {"title": "The NSA’s Split-Key Encryption Proposal is Not Serious", "abstract": "The NSA's Split-Key Encryption Proposal is Not Serious discusses the NSA's 2020 proposal to require technology companies to create a \"golden key,\" a split-key that would allow the company or the NSA access to encrypted communications. Hall argues that split-key encryption is a technology infeasible, vulnerable, and costly, and would not be able to ensure any data was protected from the NSA. Therefore, Hall deems the \"golden key\" proposal unserious.", "publisher": "Center for Democracy and Technology", "date": "April 2015", "url": "https://cdt.org/insights/the-nsas-split-key-encryption-proposal-is-not-serious/", "authors": ["Joseph Lorenzo Hall"], "tags": ["2010s", "Backdoors", "Backdoors-Feasibility", "Center for Democracy and Technology", "Foreign Concerns", "Going Dark"], "slug": "the-nsas-split-key-encryption-proposal-is-not-seri-126e61d2"}, {"title": "The Human Rights Benefits of Encryption", "abstract": "The Human Rights Benefits of Encryption is a blog post detailing public interest organizations' efforts to have encryption recognized as a right by the UN Human Rights Council. This article describes submissions by a multitude of public interest organizations—including the ACLU, Human Rights Watch, and technology-specific organizations—and their arguments for the importance of encryption to free expression, privacy, and human rights.", "publisher": "New America", "date": "March 2015", "url": "https://www.newamerica.org/oti/blog/the-human-rights-benefits-of-encryption/", "authors": ["Andi Wilson Thompson"], "tags": ["2010s", "ACLU", "Article 19", "Center for Democracy and Technology", "Citizen Lab", "Human Rights", "Human Rights Watch", "OTI"], "slug": "the-human-rights-benefits-of-encryption-9be91f1d"}, {"title": "The Five Eyes Statement on Encryption: Things Are Seldom What They Seem", "abstract": "This report from Lawfare details a summit of law enforcement officials from the Five Eyes intelligence alliance—made up of Australia, Canada, New Zealand, the United Kingdom, and the United States—and argues that the rhetoric espoused was far less troubling than it seemed. At the summit, Australian officials detailed an aggressive stance against encryption. However, by ignoring technical realities, the policy proposals are rendered toothless. Therefore, the summit acted as a reflection of the strong push by law enforcement officials to regulate the use of encryption, but the ultimate impracticality of such proposals.", "publisher": "Lawfare", "date": "September 2018", "url": "https://www.lawfareblog.com/five-eyes-statement-encryption-things-are-seldom-what-they-seem", "authors": ["Landau, Susan"], "tags": ["2010s", "Canada", "Five Eyes", "Law Enforcement", "NZ"], "slug": "the-five-eyes-statement-on-encryption-things-are-s-be5639a2"}, {"title": "The Evolution of US Government Restrictions on Using and Exporting Encryption Technologies (U)", "abstract": "This declassified report outlines the development of encryption technology by the United States government, and how private actors have challenged the government’s monopoly and changed the landscape of encryption. The report begins by detailing the creation of the NSA and the development of cryptography and provides a timeline through key escrow in the 1990s. The article ends by proposing potential paths for the future of cryptography and urging the Clinton Administration to seek an international resolution to require key escrow registration to allow governments a back door while preventing foreign technology as an alternative to complying with American requirements.", "publisher": null, "date": null, "url": "https://www.cia.gov/library/readingroom/docs/DOC_0006231614.pdf", "authors": ["Schwartzbeck, Michael"], "tags": ["1990s", "CIA", "Intelligence", "International"], "slug": "the-evolution-of-us-government-restrictions-on-usi-2a478a7b"}, {"title": "The Encryption Debate in the European Union", "abstract": "The Encryption Debate in the European Union is a policy brief that describes the intensifying encryption debate in the European Union, the interests and actors involved, and a possible timeline and substance of potential legislation. While encryption had largely thrived in Europe since the 1990s, the occurrence of multiple terror attacks in the late 10’s sparked a debate about encryption and national security within the EU. The article then describes a 2016 EU Council Questionnaire regarding encryption, the 2017 European Commission position on encryption,  and the technical debates surrounding those documents. The paper lays out the legal landscape for encryption going into the 2019-2024 EU Council, and the direction the encryption debate in Europe is headed.", "publisher": "Carnegie Endowment for International Peace", "date": "May 2019", "url": "https://carnegieendowment.org/2019/05/30/encryption-debate-in-european-union-pub-79220", "authors": ["Koomen, Maria and Koomen, Maria"], "tags": ["2010s", "EU", "International"], "slug": "the-encryption-debate-in-the-european-union-6437b4a5"}, {"title": "The Clipper Chip", "abstract": "This announcement regarding the Clipper Chip announces the Electronic Privacy Information Center’s attempt to challenge the national security classification of the Clipper Chip algorithm, so the algorithm may be evaluated by civilians. It provides a guide to the relevant documents explaining the organization’s positions.", "publisher": null, "date": "1994", "url": "https://epic.org/crypto/clipper/", "authors": ["Electronic Privacy Information Center"], "tags": ["1990s", "Clipper Chip"], "slug": "the-clipper-chip-edd3daa1"}, {"title": "The Burr-Feinstein Proposal Is Simply Anti-Security", "abstract": "This article described proposed legislation that would require technology companies—including device manufacturers, software developers, ISPs, and others—to decrypt data if ordered to do so by any court at any time. Further, because the proposed actions are not feasible, and if the law were enacted it would harm Americans’ privacy, all while foreign alternatives would still be available. The article argues that because the proposal is so far removed from any technologically feasible solution, it demonstrates how out of touch key regulators are with the reality of encryption.", "publisher": "Electronic Frontier Foundation", "date": "April 2016", "url": "https://www.eff.org/deeplinks/2016/04/burr-feinstein-proposal-simply-anti-security", "authors": ["Cohn, Cindy"], "tags": ["2010s", "Going Dark", "Law Enforcement"], "slug": "the-burr-feinstein-proposal-is-simply-anti-securit-e9e5d5f1"}, {"title": "Techies Urge Senator To Drop Encryption Key Plan", "abstract": "This article details a letter sent by privacy advocates to Senator Judd Gregg in response to a speech he made days after September 11, condemning encryption. Senator Gregg called for quasi-judicial rulemaking requiring backdoors, stating that it was likely that the 9/11 attackers likely used encryption in emails to plan the attack. Meanwhile, advocates stressed the impracticality of requiring a back door, as well as the risk of holding all passwords in one central location, in case that is hacked.", "publisher": "Newsbytes", "date": "October 2001", "url": "https://web.archive.org/web/20011011022244/http://www.newsbytes.com/news/01/170592.html", "authors": ["Brian Krebs"], "tags": ["2000s", "Crypto Wars", "Crypto Wars II"], "slug": "techies-urge-senator-to-drop-encryption-key-plan-7c42e2b5"}, {"title": "Mozilla Cybersecurity Delphi 1.0: Towards a User-centric Policy Framework", "abstract": "This study by Mozilla brought together 30 cybersecurity experts from academia, civil liberties, government and military, security, and technology, to discuss priorities and goals in the development of encryption policy. The report found several areas of agreement, such as prioritizing automating encryption over consumer education and the prioritization of developing behavioral and cultural norms in cybersecurity. Intending to improve the priorities in encryption policy, this report seeks to bring attention to areas in the encryption debate where policymaking and funding can be most effective.", "publisher": null, "date": "July 2015", "url": "https://blog.mozilla.org/netpolicy/files/2015/07/Mozilla-Cybersecurity-Delphi-1.0.pdf", "authors": ["Camille François", "Chris Riley", "Dave Steer", "Jochai Ben-Avie", "Su Midghall"], "tags": ["2010s", "Cybersecurity", "Policy", "Primer"], "slug": "mozilla-cybersecurity-delphi-1-0-towards-a-user-ce-3db1081f"}, {"title": "Information Security and Privacy in Network Environments", "abstract": "This 1994 report from the US Congress Office of Technology Assessment provides background on national cryptography policy, guidance on safeguarding government unclassified information, and legal issues in information security. This report provides guidance and background on existing regulations on cryptography, as well as their impact on e-commerce, information privacy, digital libraries, and intellectual property. Finally, the report emphasizes the importance of cryptography on congressional operations.", "publisher": null, "date": "September 1994", "url": "https://www.epic.org/crypto/reports/ota_1994.html", "authors": ["Computing Technologies Program (Joan Winston) Telecommunications"], "tags": ["1990s", "Crypto Wars", "Crypto Wars I", "US Congress"], "slug": "information-security-and-privacy-in-network-enviro-73af6c6d"}, {"title": "Human Rights and Encryption", "abstract": "This study from the United Nations Educational, Scientific and Cultural Organization outlines the benefits of encryption to human rights, the legality of interference with free and strong encryption, and gives best practices for nations and other stakeholders. This study offers case studies in various member states, including Germany, the United States, India, and Brazil, and looks at both legal restrictions on encryption as well as legal measures which promote its adoption. The study then goes on to discuss specific impacts encryption policy can have on human rights, including free communication between individuals, transparency of private and government actors, and the role of intermediaries in protecting those they serve. Finally, the study offers recommendations seeking to further human rights protections.", "publisher": null, "date": "2016", "url": "https://unesdoc.unesco.org/ark:/48223/pf0000246527", "authors": ["U.N. Educational, Scientific and Cultural Organization"], "tags": ["2010s", "Global", "Human Rights"], "slug": "human-rights-and-encryption-380229a2"}, {"title": "HTTPS-Everywhere for Government", "abstract": "This 2015 announcement from the White House Office of Management and Budget announces the HTTPS-Only Standard Directive, where federal websites and web services will use a secure HTTPS connection. The program seeks to solve vulnerabilities in unsecured HTTP connections and create uniformity in privacy and security standards across federal websites.", "publisher": "whitehouse.gov", "date": "June 2015", "url": "https://obamawhitehouse.archives.gov/blog/2015/06/08/https-everywhere-government", "authors": [], "tags": ["2010s", "HTTPS", "Obama"], "slug": "https-everywhere-for-government-5c0a30ab"}, {"title": "How Unvalidated Encryption Threatens Patient Data Security", "abstract": "This article argues that failures by regulators to enforce precise encryption rules in data breaches by healthcare providers endanger allow substandard encryption to continue operating, endangering patient data. The article discusses the HIPAA, and subsequently elucidating NIST standards for encryption for healthcare patient data. However, because of leniency enforcement, vendors continue providing inadequate encryption without fear of consequences. The article argues that consistent enforcement of the NIST standards will ensure more secure data protection for healthcare patients.", "publisher": "HealthITSecurity", "date": "July 2016", "url": "https://healthitsecurity.com/news/how-unvalidated-encryption-threatens-patient-data-security", "authors": ["HealthITSecurity"], "tags": ["2010s", "Healthcare"], "slug": "how-unvalidated-encryption-threatens-patient-data-f2fafa62"}, {"title": "Holder Urges Tech Companies to Leave Device Backdoors Open for Police", "abstract": "This news article from 2014 features comments from Attorney General Eric Holder urging technology companies to insert back doors into their products because encryption could potentially imperial investigations into kidnapping and sexual predation of children. Holder stated that companies could design technology in such a way that would not burden privacy. This article outlines statements from a top law enforcement official, linking encryption to crimes against children.", "publisher": "Washington Post", "date": "September 2014", "url": "https://www.washingtonpost.com/news/the-switch/wp/2014/09/30/holder-urges-tech-companies-to-leave-device-backdoors-open-for-police/", "authors": [], "tags": ["2010s", "Backdoors", "Government Access", "Mobile"], "slug": "holder-urges-tech-companies-to-leave-device-backdo-1737189d"}, {"title": "H.R. 4170 - Ensuring National Constitutional Rights for Your Private Telecommunications Act of 2019", "abstract": "The ENCRYPT Act of 2019, introduced into the Senate with bipartisan support, seeks to preempt state and local governments from compelling private companies to weaken encryption or insert backdoors. Therefore, this bill would make encryption policy the subject of federal law and out of the hands of state and local lawmakers.", "publisher": null, "date": "August 2019", "url": "https://www.congress.gov/116/bills/hr4170/BILLS-116hr4170ih.pdf", "authors": ["Lieu, Ted and DelBene, Suzan and Jordan, Jim"], "tags": ["2019", "Bill", "ENCRYPT Act of 2019", "Federalism", "State's Rights", "US Congress"], "slug": "h-r-4170-ensuring-national-constitutional-rights-f-808a9c8d"}, {"title": "Going Dark: Are Technology, Privacy, and Public Safety on a Collision Course?", "abstract": "This speech by FBI Director James Comey, offered at the Brooking Institute in 2014, discusses the challenges that encryption and going dark present to law enforcement. Director Comey discusses how a proliferation in digital data and communication are increasingly encrypted, and how law enforcement is technologically incapable of keeping up. Further, CALEA is not equipped to offer fair access to newer forms of technology. The speech closes by urging the American public to engage with these issues and become involved. This speech offers a look into the mindset of law enforcement in 2014, and how they viewed the challenges that encryption presented.", "publisher": null, "date": "October 2014", "url": "https://www.fbi.gov/news/speeches/going-dark-are-technology-privacy-and-public-safety-on-a-collision-course", "authors": ["Comey, James"], "tags": ["2010s", "FBI", "Going Dark", "James Comey", "Public Safety", "Speech"], "slug": "going-dark-are-technology-privacy-and-public-safet-b115d093"}, {"title": "From Clipper Chip to Smartphones: Unlocking the Encryption Debate", "abstract": "This Podcast features comments made by security experts and privacy advocates made in the 1990s about the Clipper Chip. It offers a look back into what the policy discussion looked like concurrently with the Clipper Chip proposals. Some of those who previously made comments offer follow-up, looking back at the development of their views and policy positions and how they have developed in the intervening years.", "publisher": null, "date": null, "url": "https://www.sciencefriday.com/segments/from-clipper-chip-to-smartphones-unlocking-the-encryption-debate/", "authors": ["Flatow, Ira"], "tags": ["1990s", "2010s", "Backdoors", "Clipper Chip", "Mobile", "Primer"], "slug": "from-clipper-chip-to-smartphones-unlocking-the-enc-cbe23268"}, {"title": "Former National-Security Officials Suddenly See the Peril of Weakening Encryption", "abstract": "This new article examines how former national security officials, after leaving their government jobs for private industry, tended to support strong encryption and argued against mandatory backdoor access. The article reported comments made by several former national security officials who had then transitioned to private industry, and the comments they made against government infringement on encryption at the Aspen Security Forum in 2015. The article points out that even those most sympathetic to the needs of law enforcement tended to support strong encryption, undermining arguments that opponents of backdoors are unserious or ignorant about the problems encryption presents to law enforcement.", "publisher": "The Atlantic", "date": "July 2015", "url": "https://www.theatlantic.com/politics/archive/2015/07/former-national-security-officials-see-the-peril-of-weakening-encryption/399848/", "authors": ["Friedersdorf, Conor"], "tags": ["2010s", "NSA", "National Security"], "slug": "former-national-security-officials-suddenly-see-th-d46b3725"}, {"title": "Encryption and the Press Clause", "abstract": "This law review article by D. Victoria Baranetsky argues that, through a historical understanding of the purpose of the Press Clause, the First Amendment protects encryption technology. The article begins by describing the Framers’ intent and purpose in the Press Clause, as well as the traditional interpretations and debates that have arisen surrounding its meaning, then goes on to describe how those interpretations may interact with and protect encryption. The article proposes that because encryption is ubiquitous in the dissemination of information, the Press Clause must support encryption as a channel of information and protect against state interference with encryption as a channel of speech and information.", "publisher": "Journal of Intellectual Property and Entertainment Law", "date": "2017", "url": null, "authors": ["Baranetsky, D Victoria"], "tags": ["2010s", "Amendment I", "Apple", "Crypto Wars", "Crypto Wars I", "Crypto Wars II", "Journalism", "San Bernardino"], "slug": "encryption-and-the-press-clause-46f389c7"}, {"title": "Encryption and the First Amendment", "abstract": "This law review article by Jan H. Samoriski, John L. Huffman, and Denise M. Trauth describes finds that Clinton Administration proposals on encryption policy, including the Clipper Chip initiatives, encryption key escrow, and domestic restrictions on encryption infringe on the privacy interests of individuals and likely violate the First Amendment. The article first described the development of encryption policy through the '90s. Then, the article establishes existing First Amendment case law, encryption as speech, relevant government interests, as well as the driving policies of the First Amendment, and how they support individual use of encryption without government imposition. Finally, the article writes in support of prioritizing individual liberties over vague government interests in law enforcement and national security.", "publisher": "Communication Law and Policy", "date": "September 1997", "url": "https://doi.org/10.1080/10811689709368633", "authors": ["Samoriski, Jan H. and Huffman, John L. and Trauth, Denise M."], "tags": ["1990s", "Amendment I", "Clinton", "Law Enforcement"], "slug": "encryption-and-the-first-amendment-333ee479"}, {"title": "Encryption and Globalization", "abstract": "This law review article by Peter Swire and Kenesa Ahmad discusses changes to Indian and Chinese encryption laws. The article begins by describing the development of U.S. encryption laws, mainly focusing on the crypto wars and the United States' eventual embrace of encryption. However, the article then discusses globalization that has taken place since the 1990s, and how policy positions developed during the crypto wars are no longer sufficient when considering the increased interconnectedness of the world. The article argues that because of globalization, cybersecurity risks in every nation now present risks far beyond their own borders, and that the U.S.-centric debates of the crypto wars do not account for encryption policy in adversarial nations. Finally, the article argues that recent developments in Chinese and Indian encryption laws must foster a new debate about encryption policy globally, and in the US. This article proposes that strong encryption is especially essential in an increasingly globalized world.", "publisher": "SSRN Electronic Journal", "date": "2012", "url": "http://www.ssrn.com/abstract=1960602", "authors": ["Swire, Peter P. and Ahmad, Kenesa"], "tags": ["2010s", "Crypto Wars", "Crypto Wars I", "Global"], "slug": "encryption-and-globalization-9e3100e9"}, {"title": "Encryption 101: A Non-Technical Guide to Protecting Your Digital Communications", "abstract": "This article from Danielle Kehl offers a beginner's guide to encryption, including how the technology works, its development, its modern uses, and how one can implement encryption technology into their daily life to increase their personal privacy. This article includes discussion of Hypertext Transfer Protocol (HTTPS), Secure Sockets Layer (SSL) protocol and its successor, Transport Layer Security (TLS).", "publisher": "Slate", "date": "February 2015", "url": "https://slate.com/technology/2015/02/what-is-encryption-a-nontechnical-guide-to-protecting-your-digital-communications.html", "authors": ["Kehl, Danielle"], "tags": ["2010s", "Primer"], "slug": "encryption-101-a-non-technical-guide-to-protecting-a4994675"}, {"title": "DOJ Plans to Strike Against Encryption While the Techlash Iron Is Hot", "abstract": "This blog post by Riana Pfefferkorn argues that since 2016, the Department of Justice sought to capitalize on public anti-technology sentiment to weaken encryption. First, the article describes the political climate, shaped by the Apple v FBI case, the role of big tech in various privacy scandals and foreign interference in the 2016 election, and foreign legislation, particularly in Australia and the U.K., restraining encryption. The article goes on to describe the proposed U.S. legislation and the DOJ's actions which seeks to limit encryption, and how those actions are fueled by the political climate and negative sentiments towards technology companies. Finally, the article predicts what actions legislators and law enforcement will take to limit encryption, and how the backlash against technology companies may be further weaponized.", "publisher": "The Center for Internet and Society at Stanford Law School", "date": "February 2020", "url": "/blog/2020/02/doj-plans-strike-against-encryption-while-techlash-iron-hot", "authors": ["Pfefferkorn, Riana"], "tags": ["2020s", "Apple", "Government Access", "Government Policy", "International", "Stanford CIS"], "slug": "doj-plans-to-strike-against-encryption-while-the-t-bdfdad83"}, {"title": "Disputes on Electronic Message Encryption Take on New Urgency", "abstract": "This article, Disputes on Electronic Message Encryption Take on New Urgency, written by John Schwartz and published in the New York Times shortly after 9/11, describes how the attack on the World Trade Center, and the possibility that the attackers used encrypted communications in the planning and execution of the attack, renewed debate on law enforcement access to encrypted technologies. The article describes the applicability of key escrow and the Clipper Chip to accessing encrypted communications, and legislative proposals for access proposed in the days after 9/11. This article describes the debate on law enforcement access and the balance of access and privacy in the time shortly after 9/11.", "publisher": "The New York Times", "date": "September 2001", "url": "https://www.nytimes.com/2001/09/25/business/disputes-on-electronic-message-encryption-take-on-new-urgency.html", "authors": ["Schwartz, John"], "tags": ["2000s", "9/11", "Crypto Wars", "Crypto Wars II", "Terrorism"], "slug": "disputes-on-electronic-message-encryption-take-on-6dfb72b1"}, {"title": "Deputy Attorney General Rod J. Rosenstein Delivers Remarks at the Global Cyber Security Summit", "abstract": "This speech by Deputy Attorney General Rod J. Rosenstein at the Global Cyber Security Summit in 2017 argues that competitive forces lead technology companies and the makers of encrypted technologies to resist cooperation with law enforcement. The speech details global cybersecurity threats, and how government programs, such as the Department of Defense and Department of justice have developed programs to help counter cyber attacks. However, warrant-proof encryption prevents the government from effectively countering such attacks. Mr. Rosenstein argues that the traditional balance between privacy and law enforcement need is balanced by the judicial system, and warrant-proof encryption disrupts that balance, and therefore responsible encryption that allows for law enforcement access should be required.", "publisher": null, "date": "October 2017", "url": "https://www.justice.gov/opa/speech/deputy-attorney-general-rod-j-rosenstein-delivers-remarks-global-cyber-security-summit", "authors": ["Rosenstein, Rod"], "tags": ["2010s", "Government Policy", "Law Enforcement"], "slug": "deputy-attorney-general-rod-j-rosenstein-delivers-a3df0cc4"}, {"title": "Demystifying U.S. Encryption Export Controls", "abstract": "This 1996 law review article by James Altman and William McGlone seeks to offer practical insights on export controls of encryption software and the underlying policy consideration. First, this article establishes the landscape of encryption in global business and trade. Second, the article explains the U.S. export controls and licensing requirements in place in 1996, including the scope of laws, agency jurisdiction. Third, the article surveys various initiatives—including the Clipper Chip, the National Research Council Report, proposed legislation, as well as international alternatives—seeking to reform export controls. Finally, the article considers policy concerns such as freedom of speech and national security, their tensions, and their effects on litigation and the development of law.", "publisher": "American University Law Review", "date": "1996", "url": "https://heinonline.org/HOL/P?h=hein.journals/aulr46&i=507", "authors": ["James B. Altman", "William McGlone"], "tags": ["1990s", "Export Controls", "Keys", "Law Enforcement"], "slug": "demystifying-u-s-encryption-export-controls-22620d22"}, {"title": "Deep Dive into Crypto “Exceptional Access” Mandates: Effective or Constitutional—Pick One", "abstract": "Deep Dive into Crypto “Exceptional Access” Mandates: Effective or Constitutional—Pick One by Andrew Crocker and Nate Cardozo argues that any exceptional access mandate would violate the First Amendment. The article is responding to a plethora of news coverage, citing law enforcement officials and detailing law enforcement’s need for “exceptional access” to allow government access to all encrypted materials. The article next argues that any exceptional access would require government control over the development of encryption software, which is speech, and would therefore violate the First Amendment’s ban on prior restraint. This article argues that any exceptional access mandate which would effectively serve its purpose would violate the First Amendment.", "publisher": "DeepLinks (Electronic Frontier Foundation)", "date": "August 2015", "url": "https://www.eff.org/deeplinks/2015/08/deep-dive-crypto-exceptional-access-mandates-effective-or-constitutional-pick-one", "authors": ["Cardozo, Nate and Crocker, Andrew"], "tags": ["2010s", "CALEA"], "slug": "deep-dive-into-crypto-exceptional-access-mandates-4ed0e169"}, {"title": "Decryption Originalism: The Lessons of Burr", "abstract": "This law review article by Orin Kerr describes Fifth Amendment arguments in the treason trial against Aaron Burr and their application potential application to a Supreme Court case regarding encryption. The 1807 trial of Aaron Burr was exhaustively documented and therefore is able to shed light on the founder’s original intent of the Fifth Amendment’s prohibition on self-incrimination. Kerr applies these underlying intents and principles of the Fifth Amendment and applies them to the modern debate on encryption.", "publisher": "Harvard Law Review", "date": "February 2020", "url": "https://papers.ssrn.com/abstract=3533069", "authors": ["Kerr, Orin"], "tags": ["2020s", "Amendment V", "Amendment V / Self Incrimination", "Mobile"], "slug": "decryption-originalism-the-lessons-of-burr-a1d594eb"}, {"title": "Debate: Law Enforcement vs. Smartphone Encryption", "abstract": "This debate features former government officials, technologists, and privacy advocates about encryption being offered as a default on smartphones. One side argues that this move will deprive law enforcement of the ability to seek evidence, even with a warrant, and discusses the possible near for congressional action to require companies to allow law enforcement access. The other side argues that such laws would undermine security and privacy, and disadvantage US technology makers.", "publisher": "New America", "date": "November 2014", "url": "https://www.newamerica.org/oti/events/debate-on-law-enforcement-vs-smartphone-encryption/", "authors": ["New America"], "tags": ["2010s", "Going Dark", "Mobile", "OTI"], "slug": "debate-law-enforcement-vs-smartphone-encryption-d2d753c0"}, {"title": "Cryptography's Role in Securing the Information Society", "abstract": "Cryptography's Role in Securing the Information Society by the National Research Council is a large, in-depth report seeking to describe and define what the national policy on cryptography could be. The report first describes the vulnerabilities, needs, and markets for cryptography for businesses and individuals, as well as the need for access for governments.  Next, the report describes policy instruments, such as export controls, escrowed encryption, the Clipper Chip, and internal federal government policies. Finally, the report describes policy options and offers recommendations. This report provides extensive background on cryptography and its policy implications.", "publisher": "The National Academies Press", "date": "1996", "url": "https://www.nap.edu/catalog/5131/cryptographys-role-in-securing-the-information-society", "authors": [], "tags": ["1990s", "Government Policy"], "slug": "cryptography-s-role-in-securing-the-information-so-07be5799"}, {"title": "Cryptography and Liberty 2000: An International Survey of Encryption Policy", "abstract": "Cryptography and Liberty is a survey by EPIC, a non-profit organization, on governmental encryption and cryptography laws around the world and the impacts of human rights. The survey focused on laws on domestic use of cryptography, disclosure requirements for encryption keys, import and export controls, and which government agencies or entities regulate cryptography and encryption.", "publisher": null, "date": "2000", "url": "https://epic.org/reports/crypto2000.html/", "authors": ["Banisar, David and Madsen, Wayne"], "tags": ["2000s", "Amendment I", "EPIC", "Global", "Human Rights", "Primer"], "slug": "cryptography-and-liberty-2000-an-international-sur-3c4921c1"}, {"title": "Encryption Export Controls", "abstract": "This report from the Congressional Research Service discusses existing U.S. export controls on encryption software, First Amendment Challenges to licensing regimes, and proposed export control legislation. First, the report provides background on both the Arms Export Control Act and the Export Administration Act, and how those statutory structures applied to governmental and commercial encryption software. Second, the report summarizes Federal Court decisions regarding the First Amendment in encryption, generally deciding cases based on whether the encryption was functional or expressive. Finally, the report describes the Security and Freedom Through Encryption (SAFE) Act and the Promote Reliable On-Line Transactions to Encourage Commerce and Trade (PROTECT), both as introduced in the 106th congress.", "publisher": null, "date": "January 2001", "url": null, "authors": ["Grimmett, Jeanne J."], "tags": ["1990s", "Amendment I", "Clinton", "Crypto Wars", "Crypto Wars I", "Export Controls"], "slug": "encryption-export-controls-1714ec24"}, {"title": "Canada’s New and Irresponsible Encryption Policy: How the Government of Canada’s New Policy Threatens Charter Rights, Cybersecurity, Economic Growth, and Foreign Policy", "abstract": "This article by Christopher Parsons argues that a 2019 Canadian ministerial communique weakens encryption. First, the article provides background on the history of Canadian encryption policy and the 2019 ministerial communique, and how its proposed policy would weaken encryption and require that private companies add backdoors for the Canadian government. Next, the article details the government's justifications for the policy, and how they fail to justify the weakening of encryption. Finally, the article describes how encryptions promotes freedoms and human rights, and how weakening encryption could harm public safety and cybersecurity, the economy, and foreign policy. This article argues that Canada’s weakening of encryption policy is misguided and will harm individuals, companies, and national interests alike.", "publisher": "the Citizen Lab", "date": "August 2019", "url": "https://citizenlab.ca/2019/08/canadas-new-and-irresponsible-encryption-policy-how-the-government-of-canadas-new-policy-threatens-charter-rights-cybersecurity-economic-growth-and-foreign-policy/", "authors": ["Parsons, Christopher"], "tags": ["2010s", "Canada", "Five Eyes"], "slug": "canadas-new-and-irresponsible-encryption-policy-ho-c1d6da72"}, {"title": "Brief of Amici Curiae Access Now and Wickr Foundation in Support of Apple Inc.'s Motion to Vacate", "abstract": "This amicus brief was filed by Access Now and the Wickr Foundation in support of Apple in the Central District of California, asserting that allowing the government to install software to weaken encryption would have far-reaching effects beyond the singular iPhone at hand. The FBI petitioned the court to require Apple to create and install \"GovtOS\" which would allow the FBI to work around security features and potentially access encrypted information. The Brief argues that although the warrant would apply to one iPhone, it could be redeployed in the future. This would cast doubt on the encryption of all information, not only on Apple products but also on other technology companies. Furthermore, the brief argues that this would have far-reaching effects on global encryption and human rights laws.", "publisher": null, "date": null, "url": null, "authors": ["Wickr Foundation"], "tags": ["2010s", "Apple", "Backdoors"], "slug": "brief-of-amici-curiae-access-now-and-wickr-foundat-c51e7fcb"}, {"title": "A Method for Obtaining Digital Signatures and Public-Key Cryptosystems", "abstract": "This technical article discusses an encryption method where revealing an encryption key does not reveal the corresponding decryption key. This article proposes and explains a public-key cryptosystem that would not require a courier to carry the key. Further, the article explains its uses in the context of email, and how it would allow communications to be secure and private. The article concludes by emphasizing the potentials of their encryption methods but urges more research and testing.", "publisher": null, "date": "April 1977", "url": "https://people.csail.mit.edu/rivest/Rsapaper.pdf", "authors": ["Rivest, R.L. and Shamir, A. and Adleman, L."], "tags": ["1970s", "Public Key Encryption"], "slug": "a-method-for-obtaining-digital-signatures-and-publ-eb215250"}, {"title": "A Judicial Framework for Evaluating Network Investigative Techniques", "abstract": "This article in Lawfare by Susan Hennessey and Nicholas Weaver discusses the use of the NIT in the Playpen investigation, whether the government must disclose an NIT so that defendants may receive a fair trial, and proposes questions that courts should ask when evaluating disclosure of an NIT going forward. First, this article gives a background on the Playpen investigation, and the use of an NIT in the investigation, and background on NITs generally. Second, the article discusses the legal standard for disclosure of the NIT, creating a dilemma for prosecutors wherein they must either disclose the NIT and compromising classified material, or drop the prosecution to retain the classified material. Finally, the article proposes eight guiding questions for courts when confronting an issue of disclosure and explains them in the context of the Playpen investigation. Finally, the article contemplates potential positions defendants could take in the face of such legal questions.", "publisher": "Lawfare", "date": "July 2016", "url": "https://www.lawfareblog.com/judicial-framework-evaluating-network-investigative-techniques", "authors": ["Hennessey, Susan and Weaver, Nicholas"], "tags": ["2010s", "Child Exploitation", "FBI", "Going Dark", "Law Enforcement", "NIT"], "slug": "a-judicial-framework-for-evaluating-network-invest-f6ee8147"}, {"title": "A Flawed Encryption Policy", "abstract": "This editorial in the New York Times argues that the Clinton Administration’s proposal to prevent the dissemination of encryption software to terrorists or criminals was both unworkable and presented risks to US commerce. The article discusses how industry and public interest advocates rejected the Administration’s proposals based on concerns about censorship, and the unworkability of the plan on practical grounds, including foreign unwillingness to acquiesce to potential surveillance by the U.S. Government.", "publisher": "New York Times", "date": "April 1996", "url": "https://search.proquest.com/docview/430685501/fulltext/2EA1B6B49BC74036PQ/1?accountid=14503", "authors": [], "tags": ["1990s", "Clinton", "Crypto Wars", "Crypto Wars I", "Export Controls", "Terrorism"], "slug": "a-flawed-encryption-policy-766f7f2f"}, {"title": "A Cryptography Policy Framework for Electronic Commerce: Building Canada's Information Economy and Society", "abstract": "This report summarizes the impact of encryption on Canada’s economy, the government’s policy, and how the policy could or should develop. First, the report defines cryptography and describes its uses, then describes Canada’s current encryption policy. Next, the report defines the factors and considerations crucial to developing Canada’s policies, such as commerce, State necessity, civil liberties, technical security, and international policy. Finally, the report discusses the benefits and drawbacks of various policy approaches to encryption.", "publisher": "Task Force on Electronic Commerce, Industry Canada", "date": "1998", "url": null, "authors": [], "tags": ["1990s", "Canada", "Government Policy"], "slug": "a-cryptography-policy-framework-for-electronic-com-7c268883"}, {"title": "A “Stumbling” US Encryption Policy", "abstract": "This article describes a 1997 hearing in the House of Representatives to discuss the SAFE Act, which would relax US encryption export controls. Administration officials sought to defend current key recovery policies and differentiate them from the Clipper Chip, while Representatives criticized them as unworkable, due to the necessary international cooperation. In\ndiscussing the SAFE ACT, industry representatives largely supported the bill and urged for minimal government restrictions.", "publisher": "Computer Fraud \\& Security", "date": "July 1997", "url": "http://www.sciencedirect.com/science/article/pii/S1361372397895486", "authors": ["Madsen, Wayne"], "tags": ["1990s", "Clinton", "Crypto Wars", "Crypto Wars I", "Export Controls", "Key Recovery"], "slug": "a-stumbling-us-encryption-policy-872ec273"}, {"title": "Report of the Special Rapporteur on the promotion and protection of the right to freedom of opinion and expression, David Kaye", "abstract": "On June 19, 2018, the United Nations’ Special Rapporteur on the promotion and protection of the right to freedom of opinion and expression issued a report regarding Liberia’s protections of the right to freedom of opinion and expression. The aim of the visit and subsequent report was “to assess the situation as regards the right to freedom of expression in [Liberia], in particular the issues of press freedom, media independence and diversity, and access to information.” The report discussed the background of Liberia’s freedom of opinion and expression, Liberia’s international legal obligations, Liberia’s domestic legal framework, proposed “modifications of speech law consistent with international standards”, steps Liberia can take to promote a free and independent media, how Liberia can ensure freedom of information, and concluded with a list of recommendations.", "publisher": null, "date": "May 2015", "url": "https://www.undocs.org/A/HRC/29/32", "authors": ["Kaye, David"], "tags": ["2010s", "Human Rights", "United Nations"], "slug": "report-of-the-special-rapporteur-on-the-promotion-8c9333a5"}, {"title": "Protecting the Fourth Amendment in the Information Age: A Response to Robert Litt", "abstract": "On July 27, 2016, the Yale Law Journal Forum published a short essay that agrees in part and disagrees in part with Robert Litt’s, General Counsel of the Office of the Director of National Intelligence, “new analysis for the Fourth Amendment in the Information Age”. The author rejected Litt’s proposal that the “reasonable expectation of privacy” test “should simply be eliminated”, and analyzed why Litt’s proposed balancing test is not a suitable replacement. The author believes “Litt’s formulation misses the central goal of the Fourth Amendment to prevent general searches.” The author believes instead that the correct starting point for a new Fourth Amendment analysis is the Necessary and Proportionate Principles, not the reasonable expectation of privacy test.", "publisher": "Yale Law Journal", "date": "2016", "url": null, "authors": ["Cohn, Cindy"], "tags": ["2010s", "Amendment IV", "Case Law"], "slug": "protecting-the-fourth-amendment-in-the-information-5c78fc7e"}, {"title": "Paper on Codes Is Sent Despite U.S. Objections", "abstract": "On August 9, 1989, the New York Times published an article about a Xerox Corporation computer scientist who decided to distribute “a paper describing fast and inexpensive ways of keeping information private”, in contradiction with the National Security Agency’s (NSA) request that it not be distributed due to national security concerns. The computer scientist, John Gilmore, “decided to transmit the paper to make a point about what he considers the suppression of valuable information on the technology of writing and deciphering messages in code, or cryptography.” The NSA’s main concerns were that “advances in cryptography will make it harder to break coded transmissions sent by foreign intelligence agents in the United States to their government [and] it will have more trouble protecting its own codes.” Despite the NSA’s insistence that the paper not be published, Gilmore faced no criminal or civil penalties.", "publisher": "New York Times", "date": "August 1989", "url": "https://www.nytimes.com/1989/08/09/us/paper-on-codes-is-sent-despite-us-objections.html", "authors": ["John Markoff"], "tags": ["1980s", "Export Controls"], "slug": "paper-on-codes-is-sent-despite-u-s-objections-be957f04"}, {"title": "OECD Guidelines for Cryptography Policy", "abstract": "The Organisation for Economic Co-operation and Development published the first Guidelines for Cryptography Policy on March 27, 1997, and reviews and updates them every five years. The most recent guidelines discuss the transition to electronic transactions, secret key cryptography, public key cryptography, digital signature, electronic payments, certifying public key relationships, user trust, user choice, market-driven development, standardisation, protection of privacy, lawful access, liability, international cooperation, and government activities related to cryptography policy.", "publisher": "Organisation for Economic Co-operation and Development (OECD)", "date": "March 1997", "url": "https://www.oecd.org/sti/ieconomy/guidelinesforcryptographypolicy.htm", "authors": [], "tags": ["1990s", "OECD"], "slug": "oecd-guidelines-for-cryptography-policy-3bce3cbf"}, {"title": "Newest Androids Will Join iPhones in Offering Default Encryption, Blocking Police", "abstract": "On September 18, 2014, The Washington Post published an article about the decision by Google to, for the first time, encrypt all data by default in its Android operating system. Previously, the operating system required a user to enable encryption in the device settings, but “few users [knew] how to turn on the feature.” Google made this move in order to be more competitive with Apple’s smartphones, who already encrypt all data by default. While law enforcement officials “warned that restrictions on their access to electronic devices make it much harder for them to prevent and solve crimes”, privacy advocates “are ecstatic”. The remaining significant difference between the top two smartphone competitors is the way in which Apple and Google handle encryption, given that Apple manufactures all its phones while there are several manufacturers for Android devices.", "publisher": "Washington Post's the Switch", "date": "September 2014", "url": "https://www.washingtonpost.com/news/the-switch/wp/2014/09/18/newest-androids-will-join-iphones-in-offering-default-encryption-blocking-police/", "authors": ["Timberg, Craig"], "tags": ["2010s", "Hacking", "SS7"], "slug": "newest-androids-will-join-iphones-in-offering-defa-48399d14"}, {"title": "McCaul’s Crypto Commission: First, Do No Harm", "abstract": "On March 2, 2016, AccessNow published an article about the proposed McCaul-Warner Encryption Commission, which would “create a bipartisan commission of experts to study the debate over encryption and provide recommendations for overcoming the current impasse.” The article notes that despite their good intentions, “the commission, as proposed, might not produce what” they expect. The proposal relies on “the assumption that people from both ‘sides’ of the debate have not already engaged with one another in good faith” when in fact they did in the 1990s and more recently. While the article notes that there are some positive aspects of the commission, it states that “the devil is in the details” and the details, as they stand, “leave considerable room for creating a work product that could take this debate backward rather than forward.” These details include the fact that the commission’s funding structure is opaque, the people who can be on the commission are limited due to the short length of the commission and the time it takes to get a security clearance, six of the sixteen slots will go to law enforcement or intelligence services, there is a “perverse incentive not to seek consensus for addressing difficult issues, but instead to score a ‘win’ or a political talking point.”", "publisher": "Access Now", "date": "February 2016", "url": "https://www.accessnow.org/mccauls-crypto-commission-first-no-harm/", "authors": ["White, Nathan"], "tags": ["2010s", "Digital Security", "Government Policy"], "slug": "mccauls-crypto-commission-first-do-no-harm-478ce042"}, {"title": "Keeping Secrets", "abstract": "On November 6, 2014, Stanford Magazine published an article about a group of researchers at Stanford who, at the International Symposium on Information Theory on October 10, 1997, ended “the U.S. government’s longstanding domestic monopoly on cryptography”. Prior to the symposium, the group received a letter from an NSA employee who told the group that “merely publishing a scientific paper on cryptography would be the legal equivalent of exporting nuclear weapons to a foreign country.” A lawyer at Stanford advised the group they could legally publish the information. The group decided to do so, and the fact that “a group of nongovernmental researchers could publicly discuss cutting-edge cryptographic algorithms signaled the end of the U.S. government’s domestic control of information on cryptography.” While the researchers believed that” inadequate commercial cryptography...poses an internal national security threat”, the NSA was worried that “foreign countries” would take this information and make it harder for American intelligence services to decrypt and read data. As such, the NSA tried to have Congress pass legislation to limit the publication of cryptography research, but that did not work due to the policy aims of Congress and the Carter Administration. Instead, the NSA created “a voluntary system of prepublication review for cryptography research papers,” and relied on research funding and national standards to guide the publications.", "publisher": null, "date": "December 2014", "url": "https://stanfordmag.org/contents/keeping-secrets", "authors": ["magazine, STANFORD"], "tags": ["1970s", "Government Access"], "slug": "keeping-secrets-a9f6eb24"}, {"title": "It Came from Planet Clipper: The Battle Over Cryptographic Key \"Escrow\"", "abstract": "In 1996, the University of Chicago Legal Forum published an article about the various phases of “the U.S. government’s recent attempts to keep the cryptography genie in the bottle in the face of increasing commercial and political pressure to loosen or abolish cryptographic export control.” The article discusses the export control regime for cryptography, the changing goals of U.S. cryptography policy, a summary of the Clipper chip initiative, an overview of the proposal for software-based key escrow, an in-depth exploration of “recent technical and political changes that make the current export control policy increasingly difficult to maintain”, and concludes with a discussion of trust and Congress’ role in this policy formation. The goal of the article is to “describe the issues in a rapidly changing and complex legal and technical debate [and identify] significant legal and technical issues that current government proposals do not resolve.”", "publisher": "THE UNIVERSITY OF CHICAGO LEGAL FORUM", "date": "1996", "url": null, "authors": ["Froomkin, A Michael"], "tags": ["1990s", "Clipper Chip"], "slug": "it-came-from-planet-clipper-the-battle-over-crypto-351f4ef6"}, {"title": "Issue Brief: A “Backdoor” to Encryption for Government Surveillance", "abstract": "On March 3, 2016, the Center for Democracy and Technology published an article about whether or not there should be an encryption “backdoor” for government surveillance. The article discussed the decision by Apple and Google to make their smartphones “encrypted by default”, the desire of the FBI that all encrypted communications services have a “backdoor”, the major problems created by backdoors, including the undermining of user security and harm to United States businesses, rejects the claim that “companies’ increasing adoption of strong encryption by default will suddenly lead to government ‘going dark’ and unable to access critical information”, and factors relevant to whether or not compelled decryption is legal. The purpose of the article is to convey the publisher’s findings that “a government mandate requiring companies to build a ‘backdoor’ into encryption for surveillance would put consumers at grave risk and impose heavy costs on US businesses. The government can obtain information for investigations from other sources, and may be able to compel an individual to decrypt information with a search warrant.”", "publisher": null, "date": "March 2016", "url": "https://cdt.org/wp-content/uploads/2015/12/Issue-brief-A-backdoor-to-encryption-for-government-surveillance-CDT-03032012.pdf", "authors": ["Hall, Joseph Lorenzo"], "tags": ["2010s", "Backdoors"], "slug": "issue-brief-a-backdoor-to-encryption-for-governmen-feec9f35"}, {"title": "IC on the Record, Video: ODNI General Counsel Robert Litt", "abstract": "On February 4, 2015, Robert Litt, General Counsel, Office of the Director of National Intelligence, gave a talk titled “U.S. Intelligence Community Surveillance One Year After President Obama’s [January 2014] Address” at the Brookings Institute. Litt discussed issues related to transparency in intelligent activities, limitations on surveillance, bulk collection of data, incidental collection of data, protection for non-American citizens, and the future. Litt believes the private sector can provide solutions to challenges associated with the spread of encryption. Specifically, he noted that encryption, “is a critical tool to protect privacy, to facilitate commerce, and to provide security, and the United States supports its use.  At the same time, the increasing use of encryption that cannot be decrypted when we have the lawful authority to collect information risks allowing criminals, terrorists, hackers and other threats to escape detection.” He closed out his remarks with a plea for help: “I believe that if our businesses and academics put their mind to it, they will find a solution that does not compromise the integrity of encryption technology but that enables both encryption to protect privacy and decryption under lawful authority to protect national security.", "publisher": "IC ON THE RECORD", "date": "February 2015", "url": "https://icontherecord.tumblr.com/post/110099240063/video-odni-general-counsel-robert-litt-speaks-on", "authors": ["Robert Litt"], "tags": ["2010s", "National Security", "Personal Privacy", "Surveillance"], "slug": "ic-on-the-record-video-odni-general-counsel-robert-f1f2db82"}, {"title": "Hacking/​Journalism", "abstract": "On May 19, 2011, The Washington Post published an article about one of the ways in which the “boundaries of journalism have expanded” into hacking through the adoption of encryption tools in whistleblowing cases. The article discusses the use of encryption tools in leaks including WikiLeaks’ Afghan and Iraqi War Logs, the Cablegate leaks, the Panama Papers, and Snowden’s leaks. In each of these leaks, encryption “played an enabling role in that whistleblowing” in part because it “played a fundamental part in facilitating communication between the source and the journalists.” Now, journalists and reporters are “routinely embedding traditional hacking tools within their toolbox” because encryption has “become a crucial strategy for reporters in need of a safe digital environment...or to...shield their work.” As such, “hacking-influenced journalism has proven to be a catalyst for investigative reporting” at the news outlets that embrace hacking.", "publisher": "Limn", "date": "April 2017", "url": "https://limn.it/articles/hackingjournalism/", "authors": ["Salvo, Philip Di"], "tags": ["2010s", "Hacking", "Journalism", "WikiLeaks"], "slug": "hacking-journalism-04dbfbc9"}, {"title": "H.R. 4978 - Online Privacy Act of 2019", "abstract": "On November 5, 2019, Representatives Eshoo and Lofgren introduced H.R. 4978, the Online Privacy Act of 2019. H.R. 4978 sought to incorporate elements of the California Consumer Privacy Act (CCPA) and the General Data Protection Regulation (GDPR) into federal law. As such, the bill aimed to “provide for individual rights relating to privacy of personal information, to establish privacy and security requirements for covered entities relating to personal information, and to establish an agency to be known as the United States Digital Privacy Agency to enforce such rights and requirements, and for other purposes.” The bill did not receive a vote and died in the 116th Congress", "publisher": null, "date": "December 2019", "url": "https://www.congress.gov/bill/116th-congress/house-bill/4978/text", "authors": ["Eshoo, Anna G. and Lofgren, Zoe"], "tags": ["2019", "Bill", "Data Protection", "Online Privacy Act of 2019", "Privacy Rights", "US Congress"], "slug": "h-r-4978-online-privacy-act-of-2019-7c0e40e7"}, {"title": "Guidelines for Encryption in Land Mobile Radio Systems", "abstract": "On February 8, 2016, the Federal Partnership for Interoperable Communications (FPIC) published guidelines for encryption in land mobile radio (LRM) systems for state, local, and tribal public safety entities. The report discusses the background of public safety entities and encryption, high-level technical information about encryption, types of encryption algorithms for public safety, cryptographic algorithms, and issues with interoperability. The goal of the guidelines was to get rid of confusion and competing information “regarding voice and data encryption” in LMR systems for the state, local, and tribal public safety entities.", "publisher": "Federal Partnership for Interoperable Communications", "date": "February 2016", "url": "https://www.dhs.gov/publication/encryption", "authors": [], "tags": ["2010s", "Department of Homeland Security", "Encryption Standards", "Public Safety"], "slug": "guidelines-for-encryption-in-land-mobile-radio-sys-b0ed6104"}, {"title": "Going Dark: Lawful Electronic Surveillance in the Face of New Technologies", "abstract": "On February 17, 2001, Valeria Caproni, General Counsel, Federal Bureau of Investigation, testified before the House Judiciary Committee, Subcommittee on Crime, Terrorism, and Homeland Security. In her testimony, Caproni discussed the “Going Dark” problem facing law enforcement. The “legal authorities [the FBI has] for intercepting electronic communications are adequate”, but the government often does not have the “practical ability to actually intercept those communications”. Caproni provided examples and clarifications of the Going Dark problem. She then discussed the legal framework and its limitations given evolving technology, challenges given the new technologies, and challenges facing state and local law enforcement. She concluded by stating she looks forward to working with Congress on addressing this problem in a way “that restores and maintains the ability of law enforcement agencies to intercept communications and collect related data pursuant to court orders in a manner that protects public safety, promotes innovation, and safeguards civil liberties.”", "publisher": "FBI: Federal Bureau of Investigation", "date": "February 2011", "url": "https://www.fbi.gov/news/testimony/going-dark-lawful-electronic-surveillance-in-the-face-of-new-technologies", "authors": ["Valerie Caproni"], "tags": ["2010s", "CALEA", "Going Dark", "National Security", "Terrorism"], "slug": "going-dark-lawful-electronic-surveillance-in-the-f-5165cb74"}, {"title": "The Wassenaar Arrangement: On Export Controls for Conventional Arms and Dual-Use Goods and Technologies", "abstract": "On July 26, 2015, The Wassenaar Arrangement on Export Controls for Conventional Arms and Dual-Use Goods and Technologies published an article on the history of the Wassenaar Arrangement. After the Cold War, the COCOM export control regime was disbanded. The former members of COCOM recognized “a need to establish a new arrangement to deal with risks to regional and international security and stability related to the spread of conventional weapons and dual-use goods and technologies.” From November 1993 to December 1996, the former members of COCOM worked with each other and new member states to develop a different consensus for export controls.", "publisher": "The Wassenaar Arrangement", "date": "February 2020", "url": "https://www.wassenaar.org/", "authors": [], "tags": ["1990s", "Export Controls", "International / National Security"], "slug": "the-wassenaar-arrangement-on-export-controls-for-c-1d93278e"}, {"title": "Efforts to Ban Encryption in the 1990s", "abstract": "The Electronic Privacy Information Center published an article about the efforts of the federal government, led by the Federal Bureau of Investigation, to ban encryption in the 1990s. At the time, various law enforcement federal agencies believed that a Clipper Chip type of encryption must be required in the United States. The article lists comments made by law enforcement and technology companies, federal agency documents, transcripts of congressional testimony, and proposed legislation to ban encryption.", "publisher": null, "date": "1995", "url": "https://www.epic.org/crypto/ban/", "authors": ["Center, Electronic Privacy Information"], "tags": ["1990s", "Crypto Wars", "Crypto Wars I"], "slug": "efforts-to-ban-encryption-in-the-1990s-8cb36f84"}, {"title": "Dutch Government Backs Uncrackable Encryption", "abstract": "On January 5, 2016, Fortune published an article about the Dutch government’s decision to not request a backdoor to encryption data and communications. The article noted that the government acknowledged both sides of the backdoor debate, and determined that “it is not desirable at this time to take restrictive regulatory measures with respect to the development, availability, and use of encryption within the Netherlands.”", "publisher": null, "date": "January 2016", "url": "https://fortune.com/2016/01/05/dutch-government-encryption-no-backdoors/", "authors": ["Robert Hackett"], "tags": ["2010s", "Backdoors", "NED"], "slug": "dutch-government-backs-uncrackable-encryption-8169af3a"}, {"title": "Doomed to Repeat History? Lessons from the Crypto Wars of the 1990s", "abstract": "On June 17, 2015, the Open Technology Institute at New America published a report on the history of the debate between private companies, privacy advocates, and the United States government regarding “the right to use and distribute products that contain strong encryption technology.” Topics discussed include the history of encryption before this policy debate emerged in the 1990s, the fight over Clipper Chips and key escrow, the fight over encryption export controls, the “post-war” proof that privacy experts and technology companies were right “that strong encryption is good for security, liberty, and economic growth”, and the attempts by the government to reopen the debate. The goal of the report is to assert that there was previously “a robust public debate that resolved this dispute, and nothing has changed since the 1990s that would cast doubt on the policy conclusions we reathec then; indeed, the post-war period has only reinforced those conclusions”.", "publisher": null, "date": "June 2015", "url": null, "authors": ["Kehl, Danielle and Wilson, Andi and Bankston, Kevin"], "tags": ["1990s", "Crypto Wars", "OTI"], "slug": "doomed-to-repeat-history-lessons-from-the-crypto-w-d9384864"}, {"title": "Crypto Summit 1.0", "abstract": "AccessNow published a summary of the Crypto Summit 1.0, the first of two summits, which occurred on July 15, 2015 in Washington, DC. The topics discussed in the conference focus on the United States and include crypto history, encryption technology, the current state of the law and how it should evolve, the biggest challenges and opportunities of encryption and the future of encryption based on potential policy outcomes. The goal of the conference was to “move beyond talking points to lay the groundwork for real-world solutions” regarding “the viability of different proposals to allow government access to otherwise private conversations.” The second summit, Crypto Summit 2.0, took place on March 30, 2016.", "publisher": null, "date": "July 2015", "url": "https://www.accessnow.org/crypto_summit_part1/", "authors": [], "tags": ["2010s", "Crypto Summit", "Primer"], "slug": "crypto-summit-1-0-efc034c8"}, {"title": "Questions for Apple", "abstract": "On March 1, 2016, Susan Hennessey and Benjamin Wittes, Executive Editor and Editor in Chief of Lawfare, wrote in Lawfare regarding a House Judiciary Committee hearing at which both FBI Director James Comey and Apple General Counsel Bruce Sewell were scheduled to testify on going dark matters. Hennessey and Wittes published a series of questions for Apple. The questions covered a range of topics, including anticipated impacts on Apple stemming from China’s 2015 Counterterrorism Law and Apple’s rationale for declining to comply with requests from law enforcement to decrypt their devices.", "publisher": "Lawfare", "date": "March 2016", "url": "https://www.lawfareblog.com/questions-apple", "authors": ["Susan Hennessey", "Benjamin Wittes"], "tags": ["2010s", "Going Dark", "Law Enforcement"], "slug": "questions-for-apple-b3e6b97c"}, {"title": "Promoting Public Saftey, Privacy, and the Rule of Law Around the World: The Purpose and Impact of the CLOUD Act", "abstract": "In April 2019, the Department of Justice published this White Paper on the purpose and impact of the CLOUD Act. The Paper explains the CLOUD Act was enacted to speed access to electronic information held by U.S.-based global providers (communications service providers, “CSPs”) that is critical to foreign partners’ investigations of serious crimes. Specifically, the CLOUD Act is designed to permit those “foreign partners that have robust protections for privacy and civil liberties to enter into executive agreements with the United States to obtain access” this electronic information and evidence. The White Paper goes into further detail on the scope and nature of CLOUD Act Executive Agreements and mechanisms for ensuring lawful access to data, before answering a series of frequently asked questions regarding the Act.", "publisher": null, "date": "April 2019", "url": null, "authors": [], "tags": ["2010s", "CLOUD Act", "Department of Justice", "Foreign", "International", "Law Enforcement"], "slug": "promoting-public-saftey-privacy-and-the-rule-of-la-062fe8ee"}, {"title": "OTI Policy Director Kevin Bankston Offers Ten reasons Why Backdoor Mandates Are a Bad Idea", "abstract": "In April 2015, OTI Policy Director Kevin Bankston was schedule to testify before the House Committee on Oversight and Government Reform’s Subcommittee on Information Technology regarding backdoor mandates and potential U.S. policy responses. New America published this blog post, on April 28, 2015, summarizing Bankston’s prepared statement and highlighting the ten key reasons Bankston identified against backdoor mandates. The reasons identified by Bankston were: 1) surveillance backdoors were already rejected as a policy approach two decades ago, including by Congress; 2) it would seriously undermine U.S. cybersecurity; 3) it would cost the American economy untold billions of dollars; 4) it would not succeed at keeping bad actors from using unbreakable encryption; 5) surveillance backdoors are not necessary to keep us safe from criminals—but strong encryption is key; 6) it would undermine—and turn on its head—the Fourth Amendment right to be secure in our papers and effects; 7) it would threaten First Amendment rights here and free expression around the world; 8) it would encourage countries with poor human rights records to demand backdoor access of their own; 9) an overwhelming majority of the House of Representatives and the President’s own hand-picked advisors have already rejected the idea; and 10) it would be vigorously opposed by a unified Internet community.", "publisher": "Open Technology Institute", "date": "April 2015", "url": "https://www.newamerica.org/oti/blog/oti-policy-director-kevin-bankston-offers-ten-reasons-why-backdoor-mandates-are-a-bad-idea/", "authors": [], "tags": ["2010s", "Amendment I", "Backdoors", "Cybersecurity", "Economic Impact", "Foreign Concerns", "Going Dark", "Human Rights", "OTI", "Primer", "SAFE Act", "Surveillance"], "slug": "oti-policy-director-kevin-bankston-offers-ten-reas-349f9fa5"}, {"title": "New Directions in Cryptography", "abstract": "In November 1976, Whitfield Diffie and Martin E. Hellman, of the Stanford University Department of Electrical Engineering, wrote regarding potential solutions to the need for new cryptographic systems which minimize the necessity of secure key distribution channels and supply the equivalent of a written signature. The paper noted that then-contemporary cryptography imposed such severe inconveniences on the system users (namely, the need to transfer keys prior to initially communicating) that it entirely nullified the benefits of teleprocessing and acted as a disincentive for industry adoption. As potential solutions, Diffie and Hellman recommended public key and one-way authentication systems. The paper explored the theoretical efficacy of both solutions and identified a series of “open” problems which required further attention.", "publisher": "IEEE Transactions on Information Theory", "date": "November 1976", "url": "http://ieeexplore.ieee.org/document/1055638/", "authors": ["Diffie, Whitfield and Hellman, Martin E."], "tags": ["1970s", "Diffe-Hellman Key Exchange"], "slug": "new-directions-in-cryptography-0e85af23"}, {"title": "Lawful Access – Consultation Document", "abstract": "On August 25, 2002, the Canadian Department of Justice published a consultation document on Lawful Access, an “important and well-established technique used by law enforcement and national security agencies to conduct investigations” involving the interception of communications and search and seizure of information pursuant to legislative and criminal code authorizations. The Department of Justice described tool as essential in the “prevention, investigation and prosecution of serious offences and the investigation of threats to the security of Canada.” The Consultation Document featured a series of legislative proposals, focused on modernizing the infrastructure capabilities and amending the criminal code (and other authorizing statutes), to ensure Lawful Access remained consistent with the Canadian Charter of Rights and Freedoms and adapted to rapid technological changes.", "publisher": null, "date": "August 2002", "url": "https://www.justice.gc.ca/eng/cons/la-al/consult.html", "authors": [], "tags": ["2000s", "Canada"], "slug": "lawful-access-consultation-document-a8b104aa"}, {"title": "Key Escrow from a Safe Distance: Looking Back at the Clipper Chip", "abstract": "In 2011, Matt Blaze, of the University of Pennsylvania, published a retrospective paper on the key escrow cryptosystem and the Clipper Chip. The paper begins with a carrot and stick analogy on early 1990s encryption regulations. The stick, classification of encryption as a munition and its deterrent effect on incorporation of strong encryption in consumer products. The carrot, an exception for systems incorporating a backdoor (the key escrow system). The paper also provides a technical overview of the Clipper Chip before delving into Blaze’s personal experiences with AT\\&T’s device, the TSD-3600 Telephone Security Device, while employed by the company. Blaze details the flaws he uncovered in the system, his published research on the matter, and how his discoveries landed him at the center of the system-killing New York Times piece, Flaw Found in Federal Plan for Wiretapping.", "publisher": null, "date": "2011", "url": "http://dl.acm.org/citation.cfm?doid=2076732.2076777", "authors": ["Blaze, Matt"], "tags": ["1990s", "2010s", "Crypto Wars", "Crypto Wars I"], "slug": "key-escrow-from-a-safe-distance-looking-back-at-th-acc94260"}, {"title": "James Comey, F.B.I. Director, Hints at Action as Cellphone Data Is Locked", "abstract": "On October 16, 2014, David E. Sanger and Matt Apuzzo wrote for the New York Times regarding F.B.I. Director James Comey’s comments on the potential the Obama administration would seek regulations and laws forcing companies to create an encryption backdoor to unlock photos, emails and contacts stored on cellular devices. The comments came shortly following the decisions of Apple and Google to automatically encrypt the contents of their cellphones—a first among widely used consumer devices—which Comey claimed would hinder intelligence gathering. Sanger and Apuzzo cast doubt on the likelihood of such regulations, given the administration advisory committee on the N.S.A.’s recent recommendation against “weaken[ing] or mak[ing] vulnerable generally available commercial software.”", "publisher": "The New York Times", "date": "October 2014", "url": "https://www.nytimes.com/2014/10/17/us/politics/fbi-director-in-policy-speech-calls-dark-devices-hindrance-to-crime-solving.html", "authors": ["David E. Sanger", "Matt Apuzzo"], "tags": ["2010s", "Backdoors", "Government Access", "Mobile"], "slug": "james-comey-f-b-i-director-hints-at-action-as-cell-f7538b3a"}, {"title": "International Human Rights Organizations Express Privacy Concerns About Canadian Cryptography Policy", "abstract": "On April 27, 1998, Electronic Frontier Canada, Canada’s leading online civil liberties group, issued a press release regarding the 23 civil liberty and human rights organizations—all members of the Global Internet Liberty Campaign—who signed a letter urging the Canadian government to liberalize its cryptography policy. The letter, which was issued in response to an Industry Canada report which listed possible scenarios for government regulation of encryption hardware and software, emphasized the freedom of expression, freedom of association, and privacy rights protected by cryptography. President of Electronic Frontier Canada, Dr. David Jones, delivered the letter to the Task Force on Electronic Commerce at a meeting hosted by Industry Canada.", "publisher": null, "date": "April 1998", "url": "http://www.efc.ca/pages/pr/efc-pr.27apr98.html", "authors": ["Electronic Frontier Canada"], "tags": ["1990s", "Global", "Human Rights"], "slug": "international-human-rights-organizations-express-p-07872304"}, {"title": "How secure is AES Against Brute Force Attacks?", "abstract": "In May of 2012, Mohit Arora, Sr. Systems Engineer \\& Security Architect for Freescale Semiconductor, wrote for the EE Times regarding the security of Advanced Encryption Standard (AES) against brute force attacks. Arora analyzed the system’s strength against brute force attacks with different key sizes and projected advancements in processing speeds. Ultimately, Arora concluded that “even with a supercomputer, it would take 1 billion years to crack the 128-bit AES keying using [a] brute force attack,” and thus deemed AES “safe against any brute force attack.”", "publisher": "EETimes Design Lines", "date": "May 2012", "url": "https://www.eetimes.com/how-secure-is-aes-against-brute-force-attacks/", "authors": ["Arora, Mohit"], "tags": ["2010s", "AES", "Keys"], "slug": "how-secure-is-aes-against-brute-force-attacks-a76070ac"}, {"title": "The Encryption Tightrope: Balancing Americans' Security and Privacy", "abstract": "On March 1, 2016, the House Judiciary Committee of the 114th Congress held a hearing entitled, The Encryption Tightrope: Balancing Americans’ Security and Privacy. The key focus of the hearing was answering the question: How do we deploy ever stronger, more effective encryption without unduly preventing lawful access to communications of criminals and terrorists intent on doing us harm? The Committee began the hearing by nothing its chief concern, that “[a]doption of new communications technologies by those intending harm to the American people is outpacing law enforcement’s technological capability to access those communications in legitimate criminal and national security investigations.” The concern was contextualized in the in the aftermath of the San Bernadino terrorist attack and the resultant tensions between the FBI and Apple over whether the All Writs Act compelled the company to assist in breaking the encryption on the alleged suspect’s iPhone. The hearing featured testimony, on both sides of the issue, from: FBI Director, James Comey; Senior Vice President and General Counsel at Apple, Bruce Sewell; Professor of Cybersecurity Policy at Worcester Polytechnic Institute, Dr. Susan Landau; and District Attorney for New York County, Cyrus R. Vance, Jr.", "publisher": "U.S. Government Publishing Office", "date": "March 2016", "url": null, "authors": [], "tags": ["2010s", "Going Dark", "Hearing", "Law Enforcement"], "slug": "the-encryption-tightrope-balancing-americans-secur-8372b960"}, {"title": "Half the Web Is Now Encrypted. That Makes Everyone Safer", "abstract": "In January of 2017, Klint Finley of Wired Magazine, a significant milestone in computer security news—the average volume of encrypted internet traffic “finally” surpassing the average volume of unencrypted traffic. The achievement, Finley noted, “means when you visit a website, you’re now more likely than not to see a little green lock right next to its address…indicat[ing] that the page you’ve visited came to you via HTTPS, the web’s secure protocol.” Finley acknowledged that while the milestone was significant, “there’s still another 50 percent to go.” Finley featured a few quotes from leaders in the privacy space, including then-policy manager at Access Now, Amie Stepanovich’s warning that “There’s a risk that people will think they’re more protected than they actually are,” but noted that, despite the limitations of HTTPS, it’s “better than leaving the web unencrypted.”", "publisher": "Wired", "date": "January 2017", "url": "https://www.wired.com/2017/01/half-web-now-encrypted-makes-everyone-safer/", "authors": ["Finley, Klint"], "tags": ["2010s", "HTTPS"], "slug": "half-the-web-is-now-encrypted-that-makes-everyone-2100a1e7"}, {"title": "H.R. 4943 - Clarifying Lawful Overseas Use of Data Act", "abstract": "On February 6, 2018, Representatives Collins, Jeffries, Issa, DelBene, Marino, Rutherford and Demings introduced H.R. 4943, the “Clarifying Lawful Overseas Use of Data Act” or the “CLOUD Act.” H.R. 4943 amends title 18 of the United States federal criminal code to “improve law enforcement access to data stored across borders, and for other purposes.” The bill requires electronic communication service (ECS) and remote computer service (RCS) providers to comply with existing preservation, backup and disclosure requirements pertaining to contents of electronic communications and any record or other information pertaining to a customer or subscriber within their possession, regardless of whether the information is located within the United States. H.R. 4943 was incorporated into H.R. 1625 and signed into law by President Trump on Mar 23, 2018.", "publisher": null, "date": "February 2018", "url": "https://www.congress.gov/bill/115th-congress/house-bill/4943", "authors": ["Collins, Doug"], "tags": ["2010s", "Bill", "CLOUD Act", "Data Storage", "Foreign", "International", "Law Enforcement", "US Congress"], "slug": "h-r-4943-clarifying-lawful-overseas-use-of-data-ac-f1395da4"}, {"title": "H.R. 2545 - Data Breach Prevention and Compensation Act of 2019", "abstract": "On May 7, 2019, Representatives Cummings and Krishnamoorthi introduced H.R. 2545, the Data Breach Prevention and Compensation Act of 2019. H.R. 2545 sought to create an Office of Cybersecurity at the Federal Trade Commission (FTC) for “supervision of data security at consumer reporting agencies, to require the promulgation of regulations establishing standards for effective cybersecurity for effective cybersecurity at consumer reporting agencies, to impose penalties on credit reporting agencies for cybersecurity breaches that put sensitive consumer data at risk, and for other purposes.” The bill did not receive a vote and died in the 116th Congress.", "publisher": null, "date": "May 2019", "url": "https://www.congress.gov/bill/116th-congress/house-bill/2545/text", "authors": ["Cummings, Elijah E. and Krishnamoorthi, Raja"], "tags": ["2010s", "Bill", "Data Breach Prevention and Compensation Act of 2019", "Federal Trade Commission", "Office of Cybersecurity", "US Congress"], "slug": "h-r-2545-data-breach-prevention-and-compensation-a-2d6fd580"}, {"title": "Prepared Statement by Senator Chuck Grassley, Hearing On “Going Dark: Encryption, Technology, and the Balance Between Public Safety and Privacy", "abstract": "On July 8, 2015, Chairman of the Senate Judiciary Committee, Senator Chuck Grassley, addressed a Senate hearing, inquiring “whether recent technological changes have upset the balance between public safety and privacy.” Of particular focus for Senator Grassley was responding to law enforcement questions of “whether the laws Congress has enacted over the years to adapt [the framework of the Fourth Amendment] to changing technology, such as the Communications Assistance for Law Enforcement Act, or CALEA, are adequate to the task [of preserving the rule of law, ensuring the maintenance of public safety, and protecting individual privacy and civil liberties].” Senator Grassley gave voice to law enforcement concerns of “Going Dark,” which stress that despite being able to secure warrants to search for evidence of a crime, encryption has hindered the ability to intercept real-time communications and to search “data at rest” on encrypted devices. Senator Grassley also lent credence to concerns of officials within the privacy and technology communities that any reform would undermine the privacy interests of US citizens and the international competitiveness of domestic technology companies. In closing, Senator Grassley emphasized his hope that “the Senate takes a first step at seeing if any consensus is possible on this important and complicated issue.”", "publisher": null, "date": "July 2015", "url": null, "authors": ["Grassley, Chuck"], "tags": ["2010s", "Child Exploitation", "FBI", "Going Dark", "Hearing", "Law Enforcement"], "slug": "prepared-statement-by-senator-chuck-grassley-heari-63a8fa1c"}, {"title": "GAO Report on Communications Privacy", "abstract": "In November 1993, the GAO produced a report, at the request of Jack Brooks, the then Chairman of the House Judiciary Committee, exploring the impact of federal policies on U.S. corporations’ ability to protect themselves against economic espionage. The Report focused on a few key issues: the need for information privacy in computer communications system through encryption; federal agency authority to develop cryptographic standards for the protection of sensitive, unclassified information; the roles, actions and policies of NSA and the Department of State related to export controls for products with encryption capabilities and industry rationale for requesting liberalization of controls; and the Federal Bureau of Investigation’s (FBI) legislative proposal regarding telephone systems that use digital communications technology. The Report concluded that increased usage of computer and communication networks, and ever-increasing dependence on IT, heightened U.S. industry’s risk of losing “proprietary information” to economic espionage. Further, the Report found federal policies to be a direct hinderance on industry risk reduction efforts, by negatively impacting the use, export and development of commercial encryption technology.", "publisher": null, "date": "November 1993", "url": "https://epic.org/crypto/reports/gao_comm_privacy.html", "authors": ["U.S. General Accounting Office"], "tags": ["1990s", "Crypto Wars", "Crypto Wars I", "National Security"], "slug": "gao-report-on-communications-privacy-9342867b"}, {"title": "Former GCHQ Boss Backs End-to-End Encryption", "abstract": "In July of 2017, John Leyden of The Register, wrote regarding a statement made by former GCHQ Director Robert Hannigan against proposals to build backdoors into end-to-end encryption programs. In an interview with BBC Radio 4’s program Today, Hannigan explained “encryption is overwhelmingly a good thing. It keep us all safe and secure.” Rather than building in backdoors or “un-invent[ing] encryption,” Hannigan expressed support for cooperation between private tech companies and government agencies to “find a way around it,” by “target[ing] the people who are abusing\" encryption systems and going after their smartphones or laptops through alternative means. Hannigan cited the Clinton Administration’s attempts to legislate restrictions on encryption as justification for why a legislative approach should be “a blunt last resort.”", "publisher": "The Register", "date": "July 2017", "url": "https://www.theregister.co.uk/2017/07/10/former_gchq_wades_into_encryption_debate/", "authors": ["Leyden, John"], "tags": ["2010s", "End-to-End Encryption"], "slug": "former-gchq-boss-backs-end-to-end-encryption-8c807a3b"}, {"title": "“Five Eyes” Governments Respond to Coalition Demands to Stop Undermining Encryption", "abstract": "Status update on the Five Eyes governments' position on encryptionIn October of 2017, Amie Stepanovich and Bennett Cyphers of Access Now, wrote regarding the organization’s decision to join the more than 80 members of civil society from the “Five Eyes” countries in a letter calling on government leaders to protect strong encryption, and the responses received to date. The letter called for “an unequivocal rejection of laws, policies or other mandates or practices—including secret agreements with companies—that limit access to or undermine encryption and other secure communications tools and technologies.” At the time of writing, the signatories had received responses from three of the five nations which comprise the Five Eyes: New Zealand, Canada, and the United Kingdom. New Zealand acknowledged receipt of the letter, expressed a continued interest in the use, and signified plans to have their Directors of National Security Policy and Cyber Policy meet with the New Zealand based groups that signed the letter. Canada’s response embodied much of the debate over encryption, expressing the law enforcement challenges encryption poses as well as the importance of encryption for the rights and freedoms of Canadians online. The Canadian government, at the time of writing, had yet to commit to a public position on encryption. The United Kingdom’s response was the most exhaustive. It listed actions taken by the government in acknowledgment of freedom of expression and privacy, recognized the role encryption plays in the digital economy, and expressed the UK government’s belief that law enforcement and intelligence services need to be able to gain specific information about what “serious criminals and terrorists are doing online, without compromising wider safety and security” for lawful users.", "publisher": "Access Now", "date": "October 2017", "url": "https://www.accessnow.org/five-eyes-governments-respond-coalition-demands-stop-undermining-encryption/", "authors": ["Cyphers, Bennett and Stepanovich, Amie"], "tags": ["2010s", "Five Eyes"], "slug": "five-eyes-governments-respond-to-coalition-demands-c670f1bb"}, {"title": "'Five Eyes' Security Alliance Calls for Access to Encrypted Material", "abstract": "In July of 2019, Reuters Staff reported on a statement made that week by the Five Eyes Intelligence Alliance that “Tech companies should include mechanisms in the design of their encrypted products and services whereby governments, acting with appropriate legal authority, can obtain access to data in a readable and usable format.” Following a two-day summit in London, the five allied States reached an agreement with tech industry officials to “collaborate with the Five Eyes on a set of voluntary principles . . . on steps to combat child sex abuse, including the growing threat of livestreaming.” However, the agreement did not appear to feature the encryption backdoors requested by the nations’ intelligence agencies nor did it appear that any deal was likely, as tech firms have continued to warn that “putting ‘backdoors’ into their systems to allow authorities access would weaken security and make them more vulnerable to attacks from criminals or foreign states.”", "publisher": "Reuters", "date": "July 2019", "url": "https://www.reuters.com/article/us-security-fiveeyes-britain-idUSKCN1UP199", "authors": ["Hosenball, Mark and Holden, Michael"], "tags": ["Britain", "Five Eyes", "International / National Security", "Internet / World Wide Web", "Judicial Process / Court Cases / Court Decisions", "Privacy / Data Protection"], "slug": "five-eyes-security-alliance-calls-for-access-to-en-c3db0c94"}, {"title": "Feds Put Heat on Web Firms for Master Encryption Keys", "abstract": "In July of 2013, Declan McCullagh, a senior writer for CNET, wrote regarding the continued effort of major U.S. intelligence agencies (the FBI and NSA) to obtain master encryption (SSL) keys used by internet service providers to shield private communications. McCullagh referred to the efforts of the U.S. government as a “technological escalation in the clandestine methods that the FBI and National Security Agency employ when conducting electronic surveillance against Internet users,” and warned of the sheer scope of the information which could be intercepted if such a key were turned over. A government source, cited by McCullagh, expressed concern that while large Internet companies are able to resist the requests on grounds that disclosure of SSL keys would be illegal, smaller companies, without well-staffed legal departments, might be less willing to put up the fight. At the time of publishing, no Internet company had yet turned over an SSL key pursuant to a U.S. government request or court order.", "publisher": "CNET", "date": "July 2013", "url": "https://www.cnet.com/news/feds-put-heat-on-web-firms-for-master-encryption-keys/", "authors": ["McCullagh, Declan"], "tags": ["2010s", "Backdoors", "CNET", "Keys", "Law Enforcement"], "slug": "feds-put-heat-on-web-firms-for-master-encryption-k-c6363e83"}, {"title": "Federal Bureau of Investigation: FY 2010 Budget Request", "abstract": "The FBI’s FY 2010 budget request proposed a roughly \\$560.3 million (or 7.7\\%) increase in funding from the preceding year. Included within this requested increase in funding were plans to increase total positions by 1,389—adding 407 new agents—and program enhancements to a number of FBI projects. Most notable among the program enhancements, in the context of encryption, was a requested \\$9 million increase (to the \\$233.9 million FY 2019 budget) for Advanced Electronic Surveillance, otherwise known as the “Going Dark” program. As noted in the budget request, the program exists to support the FBI’s electronic surveillance (ELSUR), intelligence collection, and evidence gathering capabilities. The “Going Dark” moniker has long been used by the FBI to refer to the inability of law enforcement to obtain electronic information and evidence from encrypted devices related to criminal activity and investigations.", "publisher": "U.S. Department of Justice", "date": null, "url": "https://www.justice.gov/sites/default/files/jmd/legacy/2014/04/12/fbi-bud-summary.pdf", "authors": ["FBI"], "tags": ["2010s", "Going Dark", "Mobile", "National Security", "Surveillance"], "slug": "federal-bureau-of-investigation-fy-2010-budget-req-f44e795f"}, {"title": "FBI Pressuring Google, Facebook to Allow ‘Back Doors’ for Wiretapping", "abstract": "On November 17, 2010, Raw Story published an article discussing the debate surrounding a proposed expansion of The Communications Assistance for Law Enforcement Act (CALEA) of 1994. At the time, FBI Director Robert Mueller placed pressure on technology companies to build “back doors” which would “allow law enforcement to wiretap data on their networks”, in an effort “to expand the FBI’s wiretapping powers to include the latest communications technologies, including social networking sites, voice-over-Internet (VoIP) telephone services and BlackBerries.” CALEA “mandates that phone companies have to be ready to wiretap a customer if law enforcement requests it”. However, a new law the Obama administration planned to introduce “would require companies such as these to install “back door” access to their communications”. The article then discusses the talking points of the proponents and opponents of the proposed legislation. Generally, the proponents are worried about national security and helping law enforcement, while the opponents are worried about hackers, citizen rights, and government abuse of the proposed legislation.", "publisher": null, "date": "November 2010", "url": "https://www.rawstory.com/2010/11/fbi-pressuring-google-facebook-wiretapping/", "authors": ["Daniel Tencer"], "tags": ["2010s", "Backdoors", "CALEA", "Going Dark", "Government Access"], "slug": "fbi-pressuring-google-facebook-to-allow-back-doors-71473338"}, {"title": "FBI Blasts Apple, Google for Locking Police out of Phones", "abstract": "On September 26, 2014, The Washington Post published an article which discussed the FBI’s criticism of Apple and Google for “for developing forms of smartphone encryption so secure that law enforcement officials cannot easily gain access to information stored on the devices -- even when they have valid search warrants.” The article notes that “while the legal and technical changes are fueled by anger over reports of mass surveillance by the National Security Agency, the consequences are being felt most heavily by police detectives, often armed with warrants certifying that a judge has found probable cause that a search of a smartphone will reveal evidence of a crime.” Therefore, while the “outrage is directed at warrantless mass surveillance”, police detectives searching a device with a warrant “is a very different context”. While the FBI has “a spectacular arsenal of weapons”, they and other law enforcement entities argue the arsenal is not enough given the evolution of technology.", "publisher": "Washington Post", "date": "September 2014", "url": "https://www.washingtonpost.com/business/technology/2014/09/25/68c4e08e-4344-11e4-9a15-137aa0153527_story.html", "authors": ["Craig Timberg", "Greg Miller"], "tags": ["2010s", "Backdoors", "Government Access", "Mobile"], "slug": "fbi-blasts-apple-google-for-locking-police-out-of-79e02027"}, {"title": "FAQ on the FCC CALEA Expansion", "abstract": "In 2014 the Electronic Frontier Foundation published an article on the evolving history of the The Communications Assistance for Law Enforcement Act (CALEA) of 1994. Initially, CALEA “forced telephone companies to redesign their network architectures to make it easier for law enforcement to wiretap digital telephone calls.” In 2004, several law enforcement agencies petitioned the FCC to expand the scope of CALEA to all Internet communications services, and the FCC issued a final rule which expanded CALEA “to broadband Internet access providers and managed VoIP systems.” In 2010, the FBI tried to persuade legislators to pass legislation that “would have forced all communications services to build secret backdoors for the government to spy on users and to decrypt any encrypted messages exchanged via the service”, but they were unsuccessful. In 2013 the FBI again pushed “for a wholesale expansion of CALEA to all Internet communications services”. While this did not succeed, the article noted the FBI will resurface its argument on a yearly basis. The purpose of the article is to stress that “CALEA must not be expanded”, and any expansion in CALEA entails less Internet security and a reduction in the rights of Americans.", "publisher": "Electronic Frontier Foundation", "date": "2015", "url": "https://www.eff.org/issues/calea", "authors": [], "tags": ["1990s", "2000s", "2010s", "CALEA"], "slug": "faq-on-the-fcc-calea-expansion-cb61ed55"}, {"title": "Exploring Encryption and Potential Mechanisms for Authorized Government Access to Plaintext: Proceedings of a Workshop", "abstract": "On June 23-24, 2016, the National Academies of Sciences, Engineering, and Medicine held a “Workshop on Encryption and Mechanisms for Authorized Government Access to Plaintext”. In September 2016, The National Academies Press published a book which summarizes the “presentations and discussions” from the workshop. Participants discussed encryption mechanisms that “would enable access to plaintext information by law enforcement or national security agencies with appropriate authority.” The workshop “specifically address[ed] the following topics: (1) encryption use cases and the feasibility of segmenting encryption policies, (2) security risks of architectures for enabling access to plaintext, and (3) technical and policy mitigations for inaccessible plaintext”.", "publisher": "The National Academies Press", "date": "2016", "url": "https://www.nap.edu/catalog/23593/exploring-encryption-and-potential-mechanisms-for-authorized-government-access-to-plaintext", "authors": ["Johnson, Anne and Eisenberg, Jon and Gumbling, Emily"], "tags": ["2010s", "Crypto Wars I", "Crypto Wars II"], "slug": "exploring-encryption-and-potential-mechanisms-for-26c5994f"}, {"title": "Ex-NSA Chief Thinks the Government is Dead Wrong in Asking Apple for a Backdoor", "abstract": "On February 25, 2016, Business Insider published an article regarding comments made by a former NSA Chief, General Michael Hayden, in which he expressed his rejection of the notion that tech companies should implement a backdoor to encryption on behalf of law enforcement. While he noted that a lack of a backdoor for encryption imposes “an unfair cost”, he said “we are not required to organize our entire national life around the needs of American law enforcement.” Overall, “when you're looking at American security writ large, [he] think[s] America is a more secure, safer place with encryption that doesn't have a door that anyone can try to exploit.\" The article noted the contrast between General Hayden’s comments and those of other law enforcement government officials.", "publisher": "Business Insider", "date": "February 2016", "url": "https://www.businessinsider.com/michael-hayden-encryption-apple-2016-2", "authors": ["Business Insider"], "tags": ["2010s", "Apple", "Backdoors", "NSA", "National Security"], "slug": "ex-nsa-chief-thinks-the-government-is-dead-wrong-i-8b5c5590"}, {"title": "Ex-MI5 Chief Warns Against Crackdown on Encrypted Messaging Apps", "abstract": "On August 11, 2017, The Guardian published an article regarding comments made by a former head of MI5, Lord Evans, who does “not support a clampdown on use of encryption”. Instead, Lord Evans pointed to other, greater threats than encryption, including the state of cybersecurity as a whole, cybersecurity for the internet of things, and attacks on British democracy from foreign actors like Russia. While he noted that concerns about terrorism are valid, he said it is “very important that we should be seen and be a country in which people can operate securely – that’s important for our commercial interests as well as our security interests, so encryption in that context is very positive”.", "publisher": "The Guardian", "date": "August 2017", "url": "https://www.theguardian.com/technology/2017/aug/11/ex-mi5-chief-warns-against-crackdown-encrypted-messaging-apps", "authors": ["Grierson, Jamie"], "tags": ["2010s", "Law Enforcement", "Mobile", "UK News", "UK Security and Counter-Terrorism"], "slug": "ex-mi5-chief-warns-against-crackdown-on-encrypted-9cfea775"}, {"title": "Encryption: A 21st Century National Security Dilemma", "abstract": "In 1998, an article was published in the International Review of Law, Computers \\& Technology, which advocated for the implementation of a federal encryption scheme which utilizes export controls and a key recovery system. Export controls should be used to address issues with gathering foreign intelligence for national security matters, and a key recovery system should be used to meet the needs of law enforcement when they conduct investigations. The author argues that this regulatory scheme will “effectively balance individual privacy rights and governmental interests”. When discussing export controls and the key recovery system, the article proposes changes to legislation, analyzes the constitutionality of the proposed scheme, and discusses the policy arguments against both. The article concludes that Congress and President Clinton must act swiftly in order to protect America’s future, and argues that “the basic outline of an encryption policy which would protect our national security” already exists through exports controls and a key recovery system.", "publisher": "International Review of Law, Computers \\& Technology", "date": "July 1998", "url": "https://doi.org/10.1080/13600869855487", "authors": ["Ackerman, Wystan M."], "tags": ["1990s", "Clinton", "Export Controls", "Law Enforcement"], "slug": "encryption-a-21st-century-national-security-dilemm-bc971f67"}, {"title": "Encryption, Trust, and the Online Economy: An Assessment of the Economic Benefits Associated with Encryption", "abstract": "On November 9, 2015, the Niskanen Center published a report that assessed the economic benefits associated with the use of software-based encryption. The report’s aim is to “provide a ballpark estimate of the economic value of encryption” and “suggest how a more accurate estimate might be achieved”, with the end goal of showing “the way toward a better understanding of the role and benefit of encryption in the Internet-age economy”. The report used categories metrics that rely on encryption for their analysis: “(1) online banking and financial transactions, (2) e-Commerce and online retail, (3) information communication technologies (ICT) security revenue, employment, and insurance, (4) research and development investment, and (5) consumer surplus.” The report assesses the benefits of the use of encryption in each of these categories, and concludes that strong encryption is vital to economic health.", "publisher": null, "date": "November 2015", "url": "https://www.niskanencenter.org/encryption-trust-and-the-online-economy-an-assessment-of-the-economic-benefits-associated-with-encryption/", "authors": ["Hagemann, Ryan and Hampson, Josh"], "tags": ["2010s", "Economic Impact"], "slug": "encryption-trust-and-the-online-economy-an-assessm-b5968feb"}, {"title": "Encryption, Biometrics, and the Status Quo Ante", "abstract": "On July 6, 2015, Paul Rosenzweig, founder of Red Branch Consulting PLLC, wrote about a paradigm shift in the encryption debate, and offered a solution to deal with the paradigm shift. In 1995, data “could not be maintained in an undecryptable format”, access to data was “achieved through lawful process (either a search warrant or a subpoena)”, and the subject of an investigation received notice. Since the paradigm shift, “data is undecryptable”, due to Fifth Amendment constraints “access through lawful process if often not possible”, and the subject of an investigation “does not get notice”. The author proposed that implementing mandatory biometric encryption is the key to dealing with the paradigm shift. The author described mandatory biometric encryption as allowing “strong encryption for data at rest, just as encryption advocates want, but require manufacturers to activate the encryption using a biometric key (such as a fingerprint or iris) rather than a pass phrase”. The author discussed the advantages of using mandatory biometric encryption and states that the proposal will “return us to the status quo ante”.", "publisher": "Lawfare", "date": "July 2015", "url": "https://www.lawfareblog.com/encryption-biometrics-and-status-quo-ante", "authors": ["Rosenzweig, Paul"], "tags": ["2010s", "Backdoors", "Biometric Encryption", "Law Enforcement", "Think Tank"], "slug": "encryption-biometrics-and-the-status-quo-ante-6819368c"}, {"title": "Executive Order 13026 - Administration of Export Controls on Encryption Products", "abstract": "On November 15, 1996, President William J. Clinton issued Executive Order 13026— Administration of Export Controls on Encryption Products. This Executive Order revised the provisions of the export control system maintained by the Department of Commerce in the Export Administration Regulations, 15 CFR Part 730 et seq, and amended previously issued Executive Orders 12981 and 13020. The Order transferred certain encryption products from the United States Munitions List to the Commerce Control List; revised the procedures for inter-agency review and disposition of dual-use-export license applications, by adding the Department of Justice to the list of agencies included in the process; and rendered all EAA provisions dealing with the issuance of licenses or removal of controls (based on foreign availability considerations) inapplicable to export controls on select encryption products, however, permitted the Secretary of Commerce to made such considerations on a discretionary basis.", "publisher": "U.S. Government Publishing Office", "date": "November 1996", "url": null, "authors": [], "tags": ["1990s", "Clinton", "Executive Order", "Export Controls"], "slug": "executive-order-13026-administration-of-export-con-edfd5315"}, {"title": "Encryption Restrictions", "abstract": "In March of 2004, Ellen Messmer, Senior Editor of Network World, wrote regarding global systems of encryption restrictions on imports, exports and use, and the implications for network managers operating globally. Messmer specifically highlighted the mandatory key-sharing program in China, which requires companies to appoint an “encryption contact” to provide all keys to the Chinese government upon request, as an example of foreign encryption policy functioning to disincentive encryption use by foreign corporations operating within a given country. Messmer also noted that other areas of the world, such as Russia and Israel, “remain problematic in terms of encryption use,” due to their comparably (to the United States) stricter encryption protocols.", "publisher": "Network World", "date": "March 2004", "url": "https://www.networkworld.com/article/2331257/encryption-restrictions.html", "authors": ["Messmer, Ellen"], "tags": ["2000s", "CHN", "Global"], "slug": "encryption-restrictions-54a58dd3"}, {"title": "Encryption Policy for the 21st Century: A Future Without Government-Prescribed Key Recovery", "abstract": "In November of 1998, Solveig Singleton, Director of Information Studies at the Cato Institute, published this paper to provide a historical backdrop, comprehensive analysis of the current debates, forecast of future developments, and suggestions for United States encryption policy. Singleton stressed the importance of “very strong encryption,” denounced U.S. regulations and proposals seeking to limit development and exportation of encryption products, highlighted the implausibility of key-recovery infrastructure, and predicted a future where the entire regulation apparatus fails due to the development of a gray market in non-escrow encryption products. Ultimately, Singleton concluded that “technology will win” regardless of government action while leaving open questions regarding First and Fourth Amendment implications of encryption regulation.", "publisher": null, "date": "November 1998", "url": "https://www.cato.org/sites/cato.org/files/pubs/pdf/pa325.pdf", "authors": ["Singleton, Solveig"], "tags": ["1990s", "Crypto Wars", "Crypto Wars I", "Key Recovery"], "slug": "encryption-policy-for-the-21st-century-a-future-wi-516bac02"}, {"title": "Encryption Policy a Crowd Pleaser", "abstract": "In November of 1998, Jeff Leiper, of Silicon Valley North, wrote regarding the Canadian government’s recently instituted encryption policy and the resulting widespread approval of the private sector. Leiper explained that despite considerable exploration of potential restrictions on encryption, including a proposed requirement to keep keys in third-party escrow for law enforcement access, the Canadian government ultimately decided to institute a policy of business sector self-regulation, which imposed no restrictions on the development, importation or use of encryption products. Leiper credited the decision to the Canadian governments earnest response to sentiments shared at a meeting of “concerned industry players.”", "publisher": "Silicon Valley North, GTA Edition", "date": "November 1998", "url": "http://search.proquest.com/docview/217686754?pq-origsite=summon", "authors": ["Leiper, Jeff"], "tags": ["1990s", "Canada"], "slug": "encryption-policy-a-crowd-pleaser-eae182e4"}, {"title": "Encryption policy — A UK perspective", "abstract": "In 1997, Nigel Hickson, of the Communications and Information Industries Directorate at the UK Government’s Department of Trade and Industry, wrote to provide a business and economics perspective on the ongoing international debates regarding information security and encryption. Hickson emphasized that the Department of Trade and Industry must play a role in the debate by educating end users, producing appropriate guidance and advice standards, and in representing the views of industry in national and international debates on the issue. Hickson argued that international actors needed to reach consensus on minimum standards for Certification Agents, an approach to the legal recognition and digital signatures, and a key management infrastructure to support interoperable key recovery/key escrow products. Hickson closes his paper with a stark warning that “[w]e cannot afford to fail.”", "publisher": "Computers \\& Security", "date": "January 1997", "url": "http://www.sciencedirect.com/science/article/pii/S0167404897807948", "authors": ["Hickson, Nigel"], "tags": ["1990s", "UK"], "slug": "encryption-policy-a-uk-perspective-f43cbc0b"}, {"title": "Encryption is a Human Rights issue: Your Privacy and Pree Speech Depend on It", "abstract": "In December of 2016, Amul Kalia, a staff member of the Electronic Frontier Foundation, wrote, emphasizing the importance of encryption, through the lens of American history. Kalia highlighted the less technologically advanced uses of encrypted communications implored by the Founding Fathers of the United States (Thomas Jefferson, George Washington, and James Madison), such as coded messaging and ciphers, to argue that encryption is “crucial to a free society.” Consistent with many pro-encryption advocates, Kalia rejected the U.S. government proposals to build “backdoors” into encryption programs, labeling them “nonstarters” that are both anti-democratic and more specifically, inconsistent with the First Amendment. Kalia also expanded his discussion beyond the United States, to assert that “encryption is a global human rights issue,” as it permits people to have privacy and freely express themselves.", "publisher": null, "date": "December 2016", "url": "https://www.learnliberty.org/blog/encryption-is-a-human-rights-issue-your-privacy-and-free-speech-depend-on-it/", "authors": ["Amul Kalia"], "tags": ["2010s", "Human Rights"], "slug": "encryption-is-a-human-rights-issue-your-privacy-an-62451d82"}, {"title": "Encryption in the U.S.: Crypto Colloquium Outcomes Report", "abstract": "In September of 2017, Access Now, a non-profit dedicated to human rights advocacy in the digital age, hosted the Crypto Colloquium—an invite-only dialogue of civil society, academic experts, technology companies and former U.S. government officials—to discuss challenges associated with U.S. government agencies’ inability to access information on encrypted mobile phones. The Report, produced by Access Now, provides a summary of the key takeaways from the Colloquium, including a section on the “Lessons Learned” in each of the Law and Policy, Security, and Economics sectors. The Report also features a list of “Unanswered Questions” prompted by the discussions at the Colloquium. Stakeholders who participated in the Colloquium agreed almost unanimously that any developed solution “would likely be effective for only a minimal time, would be substantially costly, and might harm security in general.” The Colloquium Outcomes Report closes with a general consensus that while more research is needed to produce concrete data points, an exceptional access regime is likely unadvisable.", "publisher": null, "date": "January 2018", "url": "https://www.accessnow.org/cms/assets/uploads/2018/02/Encryption-in-the-United-States-Crypto-Colloquium-Outcomes-Report.pdf", "authors": [], "tags": ["2010s", "Access Now", "Backdoors", "Economic Impact", "National Security", "Primer"], "slug": "encryption-in-the-u-s-crypto-colloquium-outcomes-r-9fd86b2f"}, {"title": "Encryption Control 'Unconstitutional'", "abstract": "In August of 1997, the Associated Press wrote regarding the decision of U.S. District Judge Marilyn Hall Patel to hold the Clinton Administration’s regulations prohibiting the electronic export of computer encryption without a Commerce Department license as a violation of the First Amendment of the U.S. Constitution. Judge Patel’s order prohibited enforcement of the regulation against a mathematics professor from the University of Illinois at Chicago, Daniel Bernstein, and his encryption program, Snuffle. Judge Patel identified two key issues with the regulation: (1) its failure to set timetables or standards for the government’s licensing decision and (2) its failure to provide for judicial review. The decision was championed by pro-encryption organizations, such as the Electronic Frontier Foundation, who expressed satisfaction with the “very large impact on U.S. leadership in the software industry and electronic commerce industry” and “huge impact on privacy rights for the next 100 years” the ruling would have.", "publisher": null, "date": "September 1997", "url": null, "authors": ["The Associated Press"], "tags": ["1990s", "Clinton", "Export Controls"], "slug": "encryption-control-unconstitutional-b86acf50"}, {"title": "Encryption Backdoors Decrease Trust In The Internet", "abstract": "In May of 2015, Olaf Kolkman, the Principal of Internet Technology, Policy, and Advocacy at the Internet Society, wrote to express his support for a letter sent to President Barack Obama, by a collection of civil society organizations, corporations, trade associations, and security and policy experts. The letter expressed concern regarding a suggestion by Administration officials that companies should refrain from providing products with strong encryption unless they simultaneously weakened their security “in order to maintain the capability to decrypt their customer’s data at the government’s request.” Kolkman noted that intelligence community efforts to coerce companies to build encryption “backdoors” were misplaced, and would have the opposite of their intended effect, decreasing trust in the internet and its overall utility. Kolkman noted that, due to the public availability of the mathematical theory on which encryption is built, “even if vendors are forced to build backdoors, the bad guys will still be able to use unbreakable encryption.” Kolkman also argued that backdoors could have the unintended consequence of increasing exposure to bad actors, as the backdoors would become a more readily identifiable vulnerability within a given system. In order to make the internet more trustworthy, Kolkman argued a continued practice of strong encryption is essential.", "publisher": "Internet Society", "date": "May 2015", "url": "https://www.internetsociety.org/blog/2015/05/encryption-backdoors-decrease-trust-in-the-internet/", "authors": ["Kolkman, Olaf"], "tags": ["2010s", "Backdoors"], "slug": "encryption-backdoors-decrease-trust-in-the-interne-0da4e63b"}, {"title": "Don’t Panic: Making Progress on the “Going Dark” Debate", "abstract": "In September of 2016, the Federal Partnership for Interoperable Communications (FPIC), produced a report on the key reasons, implications, and considerations associated with the encryption of critical portions of public safety communication systems, Considerations for Encryption in Public Safety Radio Systems. As a supplement to that report, the FPIC published this two-page fact sheet, which provides a summary of the report and the policy justifications for its recommendations. The fact sheet explains the report’s focus on five primary considerations: (1) what information should be protected (encrypted); (2) what method of encryption should be implemented; (3) the impact on communications interoperability; (4) the added cost vs. the impact of compromise; and (5) the effect on public information access.", "publisher": null, "date": "February 2016", "url": null, "authors": [], "tags": ["2010s", "Going Dark"], "slug": "dont-panic-making-progress-on-the-going-dark-debat-092ae356"}, {"title": "Cracking DES: Secrets of Encryption Research, Wiretap Politics \\\\& Chip Design. How Federal Agencies Subvert Privacy", "abstract": "In 1998, the Electronic Frontier Foundation, an international non-profit digital rights group dedicated to the promotion of internet civil liberties, published a book detailing the Foundation’s \\$210,000 research project to build a machine to crack Data Encryption Standard (DES) – a DES Cracker. The book features an overview of the basic architecture of the machine; design and hardware specifications; and technical design specifications, such as the software source code, chip source code, chip simulator source code, and hardware board schematics, which enable any cryptographer to replicate their work. The motivation for the project, according to the Foundation, was to expose the “vulnerability of widely used encryption standards like DES” and to counter political discourse on DES capabilities and encryption writ large the Foundation considered to be “at odds with [their] own estimates and those of the cryptographic research community.”", "publisher": "Electronic Frontier Foundation", "date": "1998", "url": "http://archive.org/details/crackingdessecre00elec", "authors": ["Electronic Frontier Foundation"], "tags": ["1990s", "Crypto Wars", "Crypto Wars I", "EFF"], "slug": "cracking-des-secrets-of-encryption-research-wireta-a4fb65fa"}, {"title": "Considerations for Encryption in Public Safety Radio Systems", "abstract": "In September of 2016, at the request of the public safety community, the Federal Partnership for Interoperable Communications (FPIC), produced a report on the key reasons, implications, and considerations associated with the encryption of critical portions of public safety communication systems. Among the key considerations for policy and stakeholders were what to encrypt; how to encrypt; the impact on Interoperability; public information access; and general cost considerations. The report concluded that “public safety radio encryption may be the best way to protect critical information transmitted over the airwaves from compromise and disclosure,” as it “can significantly decrease the possibility that sensitive public safety information can be used to impede effective emergency response or jeopardize the safety of life and property.”", "publisher": "Federal Partnership for Interoperable Communications", "date": "September 2016", "url": "https://www.dhs.gov/sites/default/files/publications/20160830_fact_sheet_considerations_final_draft508_0.pdf", "authors": ["Pfefferkorn, Riana"], "tags": ["2010s", "Department of Homeland Security", "Encryption Standards", "Public Safety", "Public Safety Radios"], "slug": "considerations-for-encryption-in-public-safety-rad-7298abf0"}, {"title": "Coalition Letter to NIST", "abstract": "In November of 2014, a coalition of companies and civil society organizations wrote to the National Institute for Standards and Technology (NIST), President Barack Obama, and Secretary of Commerce, Penny Pritzker to “re-emphasize the importance of creating a process for establishing secure and resilient encryption standards, free from back doors.” The letter was intended to influence the final version of the NIST’s Cryptographic Standards and Guidelines Development Process, through a series of policy recommendations. The coalition recommended that, among other things, the NIST prioritize transparency on the identity and affiliation of individuals and organization that consult on the developmental process, maximize outreach and engagement with the public, commit to always provide a security proof for standards and to explain their justification, and extend the principle of Usability to its cryptography work. Moreover, in the wake of public outcry over the agency’s collaboration with the NSA, the coalition recommended NIST “publicly and irrefutability commit itself to independence from the NSA’s signals intelligence mission.”", "publisher": null, "date": "November 2014", "url": "https://www.accessnow.org/cms/assets/uploads/archive/Coalition-NIST-Nov2014.pdf", "authors": ["Stepanovich, Amie"], "tags": ["2010s", "Backdoors", "NIST"], "slug": "coalition-letter-to-nist-7f0953e7"}, {"title": "Coalition Letter to Ministers Responsible for the Five Eyes Security Community", "abstract": "In June of 2017, a coalition of 83 civil society organizations and eminent individuals wrote to the Ministers Responsible for the Five Eyes Security Community to “emphasize the importance of national policies that encourage and facilitate the development and use of strong encryption.” The coalition expressed concern with a joint communiqué – published following a Five Eyes meeting – expressing a commitment to exploring solutions to the “perceived impediment posed by encryption to investigative objectives” and plans “to press technology firms to share encrypted data with security agencies.” The coalition urged an “unequivocal rejection of laws, policies, or other mandates or practices…that limit access to or undermine encryption and other secure communications tools and technologies.”", "publisher": null, "date": "June 2017", "url": "https://www.accessnow.org/cms/assets/uploads/2017/07/Five-eyes-open-letter.pdf", "authors": [], "tags": ["2010s", "Five Eyes"], "slug": "coalition-letter-to-ministers-responsible-for-the-c239cb16"}, {"title": "Coalition Letter of Law Professors to Hon. Thomas J. Biley Regarding SAFE Amendments", "abstract": "In September of 1997, a collection of law professors from Yale, Harvard, Stanford, UCLA and twenty-six other law schools, wrote to the Thomas J. Biley, then Jr. Chairman of the House Committee on Commerce, to “express alarm about an unprecedented proposal…advanced to impose criminal penalties on the manufacturing or distribution of domestic encryption products” that lack a government-mandated “back-door.” The proposal had recently been adopted by the House Intelligence Committee and was anticipated to be offered to the Commerce Committee as an amendment – the Oxley-Manton amendment – to the Security and Freedom through Encryption (SAFE) Act. The professors expressed their belief that the amendment was a “profound mistake” that would render the United States government “the architect of the most comprehensive surveillance plan the world has seen since the end of the Cold War.” Key amongst their concerns were potential violations to the First and Fourth Amendments of the United States Constitution, and the risks of instituting a “Global Key Recovery Regime.”", "publisher": null, "date": "February 1999", "url": "https://web.archive.org/web/19990224070155/http://www.cdt.org/crypto/legis_105/SAFE/97093_profs.html", "authors": ["Aoki, Keith and Ashley, Kevin D. and Balkin, Jack M. and Boyd, William E. and Brown, Darryl K. and Burk, Dan L. and Cohen, Julie E. and Fitzgerald, Peter E. and Freedman, Eric M. and Froomkin, A. Michael and Gibbons, Llewellyn J. and Hoff, Timothy and Kang, Jerry and Katsh, Ethan and Koppelman, Andrew and Lemley, Mark and Lessig, Lawrence and Litman, Jessica and Perritt, Henry H. and Post, David G. and Radin, Margaret and Rich, William D. and Romberg, Jon and Rossi, Jim and Samuelson, Pamela and Scarberry, Mark S. and Sorkin, David E. and Swire, Peter and Moglen, Eben and Shiffrin, Steven"], "tags": ["1990s", "Academic", "Crypto Wars", "Crypto Wars I", "US Congress"], "slug": "coalition-letter-of-law-professors-to-hon-thomas-j-f69d54a6"}, {"title": "Clinton Removes Export Limits on Encryption Technology", "abstract": "In September of 1999, James Gerstenzang, a staff writer for the Los Angeles Times, reported on the Clinton Administration decision to liberalize export requirements on encryption technology. Gerstenzang’s report details the political dynamics at play leading up to and anticipated to follow the decision. This analysis includes statements from Clinton Administration cabinet officials, such as Attorney General, Janet Reno, and Deputy Assistant for National Security Affairs, James B. Steinberg, which provide context to the prolonged intelligence sector resistance to the decision and its resulting national security implications. Gerstenzang also includes a summary of anticipated economic benefits and perspectives from technology sector leaders in Silicon Valley.", "publisher": "Los Angeles Times", "date": "September 1999", "url": "https://www.latimes.com/archives/la-xpm-1999-sep-17-fi-11110-story.html", "authors": ["Gerstenzang, James"], "tags": ["1990s", "Clinton", "Crypto Wars", "Crypto Wars I", "Export Controls"], "slug": "clinton-removes-export-limits-on-encryption-techno-9f78e038"}, {"title": "Clinton Administration Announces New Cybersecurity Proposals", "abstract": "On July 17, 2000, Libbie Schlatheir, a producer for CNN, issued a report detailing announcements by Clinton Administration officials regarding updates to its policy for encryption exports to the European Union and key trading partners. The updates, attributed largely to a speech by Clinton White House Chief of Staff, John Podesta, at the National Press Club, “liberalize[d] export controls on encryption, allowing more companies to export the technology to more end users… while maintaining a framework necessary to protect [U.S.] national security.” The new policy permitted American companies to export, with license exemption, any encryption product to any end user in the European Union, Austria, Norway, the Czech Republic, Hungary, Poland, Japan, New Zealand, and Switzerland. Additionally, the policy called for elimination of the 30-day waiting period and four cyber-security proposals on data security, privacy, and criminalization of cyber-crimes.", "publisher": null, "date": "July 2000", "url": null, "authors": ["Libbie Schlatheri"], "tags": ["2000s", "Clinton", "Export Controls"], "slug": "clinton-administration-announces-new-cybersecurity-6826eb57"}, {"title": "CEOs and Encryption: The Questions You Need to Ask Your Experts", "abstract": "On March 16, 2018, Robin Wilton, Director of Internet Trust, published a paper – originally created as an internal memorandum for Internet Society CEO, Kathy Brown – detailing the key questions CEOs should ask technical experts to ensure encryption policy competency. The paper explores three key topics: (1) getting a snapshot of your organization’s crypto strategy and current states, (2) practical challenges of deployment and management, and (3) non-technical factors around risk mitigation and law enforcement access. The paper was intended to serve the dual purpose of providing CEOs the education to understand the principles and issues surrounding cryptographic technology, and to function as an “annotated checklist” to review with organization executives and managers.", "publisher": "Internet Society", "date": "March 2018", "url": "https://www.internetsociety.org/blog/2018/03/ceos-encryption-questions-need-asking-experts-2/", "authors": ["Wilton, Robin"], "tags": ["2010s", "Corporate", "Economic Impact", "Public Key Encryption"], "slug": "ceos-and-encryption-the-questions-you-need-to-ask-f054d98f"}, {"title": "Bureau of Export Administration Annual Report 1998", "abstract": "The Annual Report issued by the Bureau of Export Administration (BXA) provides the fiscal year highlights of the Bureau’s administration, enforcement and regulation of exports of dual-use commodities, technology and software from the United States and its territories. In 1998, the BXA was tasked with implementing the Clinton Administration’s commercial encryption policy. BXA was tasked with the objective of “promot[ing] growth of electronic commerce and secure communications worldwide while protecting the public safety and national security.” Highlights from the 1998 Report include the finalization of guidelines and implementation of regulations permitting the export of licensed encryption products to banks and financial institutions in 45 countries. The regulation established licensing policies and procedures for companies to obtain approval to export encryption products; created license exceptions for export of very strong encryption of any key length to certain industry sectors; and allowed encryption hardware and software with encryption strength up to 56-bit DES (or its equivalent) to be exported without a license. The Report estimated the regulation impacted encryption exports for the world’s 100 largest banks and roughly 70 percent of the world’s financial institutions.", "publisher": null, "date": "1998", "url": null, "authors": [], "tags": ["1990s", "Crypto Wars", "Crypto Wars I", "Export Controls", "National Security"], "slug": "bureau-of-export-administration-annual-report-1998-b53ffd24"}, {"title": "Congress Mulls Stiff Crypto Laws", "abstract": "On September 13, 2001, Wired published an article about the impact of 9/11 terrorist attacks on the encryption debate, and declared that “[t]he encryption wars have begun”. The article claims that the balance of the debate between privacy and security “abruptly shifted” in the wake of 9/11, and that “political winds have shifted from business to national security”. The article discusses various Clinton Administration initiatives related to encryption, and highlighted quotes from Congress members who “called for a global prohibition on encryption products without backdoors for government surveillance”. It also conveyed the concerns of business and privacy groups who rebutted the notion that weakening encryption will address national security issues.", "publisher": "Wired", "date": "September 2001", "url": "https://www.wired.com/2001/09/congress-mulls-stiff-crypto-laws/", "authors": ["McCullagh, Declan"], "tags": ["2000s", "9/11", "Crypto Wars", "Crypto Wars II", "National Security", "Terrorism"], "slug": "congress-mulls-stiff-crypto-laws-50dadb61"}, {"title": "Coalition Letter to President Obama 10/27/2016", "abstract": "On October 27, 2016, a coalition of domestic organizations and experts sent a letter to President Barack Obama in which they urged the White House to respond to a petition using the Administration's \"We the People\" platform. The petition asked that the Administration \"[p]ublicly affirm your support for strong encryption,” to “[r]eject any law, policy, or mandate that would undermine our security” online, and to \"encourage other governments worldwide to do the same.\" The letter states that the petition fulfilled the threshold requirements for an official response from the Administration, and that the Administration, which the website pledges will provide an official response within 60 days of meeting the threshold, has not provided a substantive response in the 365 days since that date. The letter then describes various actions taken by the FBI, U.S. Congress, state legislatures, China, the UK, Brazil, Russia, and India that “undermine the security of the global internet” and “endanger the technology sector globally”. The letter’s purpose is to urge President Obama to “repudiate any type of mandate requiring third-party access to encrypted data, both stored and in transit,” and to “clarify the United States’ position and establish its leadership on this critically important topic.”", "publisher": null, "date": "October 2016", "url": null, "authors": [], "tags": ["2010s", "Access Now", "Apple", "Backdoors", "EFF", "International"], "slug": "coalition-letter-to-president-obama-10-27-2016-20313e86"}, {"title": "Coalition Letter to President Obama 04/11/2016", "abstract": "On April 11, 2016, a coalition of domestic and international organizations and experts sent a letter to President Barack Obama in which they urged the White House to “specifically oppose legislation to undermine security and reiterate the need for a broad statement of support for encryption from the administration”. The letter was sent in response to a draft bill titled “Compliance with Court Order Act of 2016”, which would compel all internet companies and “any person who provides a product or method to facilitate a communication or the processing or storage of data,” to “either undermine the security features they offer users or offer lesser security so as to facilitate government access.” The letter highlights that while this bill would pose a security threat to billions of people, it would scarcely assist law enforcement in investigating crimes or terrorism. The purpose of the letter is to encourage the White House to support strong security and publicly reject the draft bill and any similar legislation that “would severely undermine digital security”.", "publisher": null, "date": "April 2016", "url": "https://www.accessnow.org/cms/assets/uploads/2016/04/Encryption-Letter.pdf", "authors": [], "tags": ["2010s", "Backdoors", "Compliance with Court Orders Act"], "slug": "coalition-letter-to-president-obama-04-11-2016-4b5abd91"}, {"title": "CALEA II: Risks of Wiretap Modifications to Endpoints", "abstract": "On May 17, 2013, the Center for Democracy \\& Technology published a report about the U.S. government’s proposal “to expand wiretap design laws broadly to Internet services, including voice over Internet protocol (VoIP) services and other peer-to-peer tools that allow communications in real-time directly between individuals.” The report discusses the fact that the U.S. government’s proposal “poses serious security risks”, and that “[r]equiring software vendors to build intercept functionality into their products is unwise and will be ineffective, with the result being serious consequences for the economic well-being and national security of the United States.” The article’s purpose is to convey the authors’ belief that the government’s proposal will be “much more costly to personal, economic and governmental security overall than the risks associated with not being able to wiretap all communications”.", "publisher": null, "date": "May 2013", "url": "https://cdt.org/wp-content/uploads/pdfs/CALEAII-techreport.pdf", "authors": ["Adida, Ben and Anderson, Collin and Anton, Annie I. and Blaze, Matt and Dingledine, Roger and Felten, Edward W. and Green, Matthew D. and Halderman, J. Alex and Jefferson, David R. and Jennings, Cullen and Landau, Susan and Mitter, Navroop and Neumann, Peter G. and Rescorla, Eric and Schneider, Fred B. and Schneier, Bruce and Shacham, Hovav and Sherr, Micah and Wagner, David and Zimmermann, Philip"], "tags": ["2010s", "CALEA II", "Wiretap"], "slug": "calea-ii-risks-of-wiretap-modifications-to-endpoin-33317ce9"}, {"title": "Big reputation: What the Australian Parliament Can Learn from Taylor Swift", "abstract": "On January 26, 2019, Access Now published an article about Australia’s passage of the draconian Telecommunications and Other Legislation Amendment (Assistance and Access Bill) Act 2018, which requires technology companies to grant law enforcement hack devices and access to encrypted messages, without judicial oversight. At the time the article was written, the bill called for further review, which opened up the potential to add “amendments, safeguards, and transparency requirements” to the bill. The article’s main focus is the lessons Australian Parliamentarians should take into consideration when they review the law. These factors include the erosion of trust, removal of companies and products from the Australian market, inadequate accountability and limitations on law enforcement, the threat that foreign governments who invoke the bill, without transparency, for a “serious crime” with abuse this right, the increased threat of malicious activity from bad actors, omission of key considerations, and the fact that the bill is more likely to hinder than help Australians and their government. This purpose of this piece is to advocate that Australian Parliamentarians postpone enacting the bill until they can demonstrate it is necessary, and notes that they can still “act to substantially revise its provisions or even vacate the law altogether in favor of a more thoughtful, useful, and effective approach that would preserve digital security and protect human rights.”", "publisher": "Access Now", "date": "February 2019", "url": "https://www.accessnow.org/big-reputation-what-the-australian-parliament-can-learn-from-taylor-swift/", "authors": ["Stepanovich, Amie"], "tags": ["\\#AABILL", "\\#DEFENDENCRYPTION", "\\#SECUREAUSTRALIA", "2010s", "Assistance and Access Bill", "Australia"], "slug": "big-reputation-what-the-australian-parliament-can-642ff3e3"}, {"title": "Breaking: FBI Admits its Claims of “Going Dark” Were Overblown, Based on Bad Math", "abstract": "The Open Technology Institute released a statement regarding a Washington Post report that the FBI overstated “the number of encrypted mobile devices it could not unlock in 2017.” While the FBI had previously claimed there were 7,775 such devices, the FBI later clarified that the real number was around 1,200. Kevin Bankston, the Director of New America’s Open Technology Institute, issued a statement which called for Congressional investigation into the false numbers and arguing that the FBI’s requests for backdoors should be met with skepticism.", "publisher": "New America", "date": "May 2018", "url": "https://www.newamerica.org/oti/press-releases/breaking-fbi-admits-its-claims-going-dark-were-overblown-based-bad-math/", "authors": [], "tags": ["2010s", "Going Dark", "OTI"], "slug": "breaking-fbi-admits-its-claims-of-going-dark-were-b620adf1"}, {"title": "Beyond Secrets: The Consumer Stake in the Encryption Debate", "abstract": "On December 21, 2017, ConsumersUnion and Upturn released this paper on consumers’ stake in the encryption debate. The paper begins with information on cryptography: what it is and how it works. It then discusses the ways in which encryption benefits consumers, including: protecting their health information, safeguarding their financial well-being, facilitating sale software updates, ensuring physical safety, and allowing consumers to communicate with confidence. The purpose of this paper is to educate consumers about the many ways that encryption benefits consumers and the systems and infrastructure consumers rely upon, and the potential costs if encryption were to be compromised. It also seeks to focus the continuing debate regarding civil liberties, national security, and “backdoors” on the value of encryption to everyday private and public life.", "publisher": null, "date": "December 2017", "url": "https://advocacy.consumerreports.org/wp-content/uploads/2017/12/Beyond-Secrets-12.21.17-FINAL.pdf", "authors": [], "tags": ["2010s", "Backdoors", "Economic Impact", "Emergency Communications", "Healthcare", "Mobile", "Primer"], "slug": "beyond-secrets-the-consumer-stake-in-the-encryptio-5a9a086a"}, {"title": "Best Practices for Encryption in P25 Public Safety Land Mobile Radio Systems", "abstract": "In September 2016, The Federal Partnership for Interoperable Communications (FPIC), in coordination with Aviation Safety Communique (SAFECOM) and the National Council of Statewide Interoperability Coordinators (NCSWIC), published a report to guide all levels of government in their efforts to improve encrypted interoperability for public safety land mobile radio systems. The “Best Practices” they advocate for the government pertain to: key management organization, key generation and distribution, adopting a National SLN assignment plan, standards-based encryption, crypto period considerations, communications planning, education and training, communications exercises and testing, and experts outreach. The report states that adherence to these practices will provide cost efficient implementation, effective protection of sensitive information, credible standards-based policy development, and successful encrypted interoperability during multi-agency emergency responses. The intent of the report is to simplify the complex process of encryption and key management, and discuss the essential elements or parameters that are needed for operability and interoperability.", "publisher": "Federal Partnership for Interoperable Communications", "date": "September 2016", "url": null, "authors": [], "tags": ["2010s", "Public Safety Radios"], "slug": "best-practices-for-encryption-in-p25-public-safety-c4ce136f"}, {"title": "Daniel J. Bernstein v. U.S. Department of State", "abstract": "In Bernstein v U.S. Department of State, the US District Court for the Northern District of California held that licensing requirements for speech relating to encryption of computer software constituted unlawful prior restraint. Daniel Bernstein, a mathematician, challenged restrictions on the exportation of cryptography from the United States. He sought declaratory and injunctive relief, facially and as-applied, against enforcement of the Arms Export Control Act (AECA) and the International Traffic in Arms Regulations (ITAR). At-issue was whether the licensing requirements for the export of cryptographic devices and software in ITAR, and the export control over related technical data, constitute an impermissible infringement on speech in violation of the First Amendment. The court reasoned that because the ITAR licensing scheme fails to provide for a time limit on the licensing decision, prompt judicial review, and a duty on the part of the ODTC to go to court and defend a denial of a license, it is an unconstitutional prior restraint in violation of the First Amendment.", "publisher": null, "date": "December 1996", "url": "https://law.justia.com/cases/federal/district-courts/FSupp/945/1279/1457799/", "authors": [], "tags": ["1990s", "Case Law", "Crypto Wars"], "slug": "daniel-j-bernstein-v-u-s-department-of-state-11e93c28"}, {"title": "Australian Government Passes Contentious Encryption Law", "abstract": "On December 6, 2018, the New York Times published an article about Australia’s passage of the Telecommunications and Other Legislation Amendment (Assistance and Access) Act 2018 (TOLA Act), which requires technology companies to grant law enforcement access to encrypted messages. The article’s main focus was relaying the arguments of the opponents and proponents of the bill. Opponents of the bill believe it compromises the privacy of Australians, could lead to abuse, and will encourage other countries to follow suit. They noted that law enforcement already has the tools to obtain encrypted data, and the bill will be used more by local law enforcement than terrorism experts. Proponents of the bill believe law enforcement access to encrypted data is required to address a legitimate governmental interest in preventing terrorism. The article also noted that Australia politicians were not willing to delay the bill because they did not want to be seen as responsible for any terror attacks over the holidays.", "publisher": "The New York Times", "date": "June 2018", "url": "https://www.nytimes.com/2018/12/06/world/australia/encryption-bill-nauru.html", "authors": ["Tarabay, Jamie"], "tags": ["Australia", "Five Eyes", "Law Enforcement"], "slug": "australian-government-passes-contentious-encryptio-6d9e9517"}, {"title": "Coalition Letter to Members of Australia's Parliament", "abstract": "On July 17, 2018 a coalition of domestic and international organizations and experts sent a letter to Australia’s parliament, urging it to not pass the Telecommunications and Other Legislation Amendment (Assistance and Access) Act 2018 (TOLA Act), which would require technology companies to grant law enforcement access to encrypted messages. The letter stresses the direct and indirect consequences of Australia’s proposed TOLA Act, should it pass. The TOLA Act would damage internet security, negatively impact important sectors, erode user trust, promote criminal activity and unauthorized access to private data, and increase the use of bots that deny users access to critical services and deliver malware. This letter was written to urge Australia’s parliament to work with law enforcement and policymakers to find alternative solutions that allow law enforcement to gain access to evidence in a timely manner, without sacrificing internet security and the privacy of personal data. Australia’s TOLA Act  was passed in December 2018.", "publisher": null, "date": "July 2018", "url": "https://www.accessnow.org/cms/assets/uploads/2018/07/Australia-Encryption-Coalition-Letter.pdf", "authors": [], "tags": ["2010s", "Australia"], "slug": "coalition-letter-to-members-of-australia-s-parliam-65b62b0b"}, {"title": "As Encryption Spreads, U.S. Grapples with Clash Between Privacy, Security", "abstract": "Ellen Nakashima and Barton Gellman explore the Obama Administration’s handling of and resistance to calls within the Intelligence and Law Enforcement communities to pressure technology companies, such as Apple, to build “back door” access to encrypted user data. The article explores numerous alternative options which were being considered by the White House, such as setting up mirror accounts or compelling companies to back up data to a company server (which would be subject to decryption with a warrant), yet identifies considerable challenges associated with each of the proposed methods. Ultimately, the Obama Administration decided against drafting legislation that would force tech companies to unlock their devices when compelled by a court order and did not endorse any of the alternatives discussed.", "publisher": "Washington Post", "date": "April 2015", "url": "https://www.washingtonpost.com/world/national-security/as-encryption-spreads-us-worries-about-access-to-data-for-investigations/2015/04/10/7c1c7518-d401-11e4-a62f-ee745911a4ff_story.html", "authors": ["Ellen Nakashima", "Barton Gellman"], "tags": ["2010s", "Government Access", "Personal Privacy"], "slug": "as-encryption-spreads-u-s-grapples-with-clash-betw-6b2738da"}, {"title": "Apple Will No Longer Unlock Most iPhones, iPads for Police, Even with Search Warrants", "abstract": "In late 2014, in response to allegations of over-participation in government efforts to collect user information, Apple announced a plan to cease turning over user data to police, even when they have a search a warrant. The move, which was classified as an “engineering solution to a legal quandary,” came in the form of an update to the Apple’s mobile operating system privacy policy and relied primarily upon the encryption automatically placed on Apple mobile devices, via the selection of an access passcode. The new policy prevented anyone but the device’s owner from gaining access to the vast trove of user data stored on Apple devices; however, the protection does not reach user data stored elsewhere, such as in the iCloud. The move was praised by civil liberties advocates, as an important step towards prioritizing consumer privacy, and condemned by law enforcement officials, who viewed it as an impediment to preventing and solving crimes. Apple has continued to steadfastly enforce this policy. Most notably, in January 2020, Apple refused to unlock the iPhones of the suspected shooter at Pensacola Naval Air Station. They have also continuously resisted calls from lawmakers to build a “backdoor” for law enforcement.", "publisher": "Washington Post", "date": "September 2014", "url": "https://www.washingtonpost.com/business/technology/2014/09/17/2612af58-3ed2-11e4-b03f-de718edeb92f_story.html", "authors": ["Craig Timberg"], "tags": ["2010s", "Backdoors", "Mobile"], "slug": "apple-will-no-longer-unlock-most-iphones-ipads-for-d5b21880"}, {"title": "Attorney General William P. Barr Delivers Keynote Address at the International Conference on Cyber Security", "abstract": "Former Attorney General William Barr delivered the keynote address at the International Conference on Cyber Security in 2019. In the speech, Barr describes encryption as a technology that gives cover to criminals, particularly drug cartels, and prevents law enforcement from solving crimes. Barr insinuates that the Fourth Amendment, through balancing personal privacy and public safety, may not allow so-called “warrant-proof encryption” and requests backdoors be added to encryption to allow  law enforcement access  to encrypted messages through pursuant to warrants.", "publisher": null, "date": "July 2019", "url": "https://www.justice.gov/opa/speech/attorney-general-william-p-barr-delivers-keynote-address-international-conference-cyber", "authors": ["Barr, William"], "tags": ["2010s", "Amendment IV", "Attorney General William P. Barr", "Department of Justice", "Law Enforcement", "Probable Cause"], "slug": "attorney-general-william-p-barr-delivers-keynote-a-55f805a8"}, {"title": "Another Faulty Encryption Policy", "abstract": "On December 16, 1996, the New York Times published an editorial piece criticizing the unworkability and risks associated with the (then) newest Clinton Administration plan to control the export of encryption software. The editorial expressed concerns related to infringement of privacy rights and damage to United States software firms, which would lose business as a result of the availability of less intrusive encryption software from foreign firms. The Times advocated on behalf of the proposal from the National Research Council – which recommended “Washington drop export restrictions on encryption software already available abroad, beef up the F.B.I.'s ability to crack private encryption codes and support private efforts to develop high quality encryption to stop illegal eavesdropping” – to improve communications security, limit intrusions to privacy, and prevent steering foreign customers toward European and Asian Software firms.", "publisher": "New York Times", "date": "December 1996", "url": "https://search.proquest.com/docview/430702910/fulltext/CAF9E584F5344769PQ/1?accountid=14503", "authors": [], "tags": ["1990s", "Clinton", "Crypto Wars", "Crypto Wars I", "Export Controls"], "slug": "another-faulty-encryption-policy-092ca4e3"}, {"title": "Anonymity and Encryption: Comments Submitted to the United Nations Special Rapporteur on the Promotion and Protection of the Right to Freedom of Opinion and Expression", "abstract": "The Electron Frontier Foundation’s comments regarding Anonymity and Encryption describe and argue for the benefit of anonymity and encryption. The comments describe what anonymity and digital anonymity are, their relevance to human rights, and policies around the world which either undermine or support the right to anonymity from both private and government actors. Finally, the comments describe encryption and its defend individuals right to encryption. The comments recommend that the United Nations Special Rapporteur establish  and strongly protect the right to anonymity. Additionally, it is recommended that both the creation of and the use of encryption be protected, and that private actors should seek to develop and not block encrypted messaging.", "publisher": "Electronic Frontier Foundation", "date": "February 2015", "url": "https://www.eff.org/files/2015/02/10/unanonymity-encryption-eff.pdf", "authors": ["Rodriguez, Katitza"], "tags": ["2010s", "EFF", "Human Rights"], "slug": "anonymity-and-encryption-comments-submitted-to-the-679d1ec2"}, {"title": "Federal Information Processing Standards (FIPS) 197: Advanced Encryption Standard", "abstract": "The Advanced Encryption Standard (AES), officially published on November 26, 2001, provides a Computer Security Standard (Cryptography), for use by Federal departments and agencies when an agency determines that sensitive (unclassified) information requires cryptographic protection. The standard may also be used and adopted by non-Federal Government organizations. The AES specifies Federal Information Process Standards’ (FIPS’) approved cryptographic algorithm that can be used to protect electronic data. The AES algorithm is a symmetric block cipher that can encrypt (encipher) and decrypt (decipher) information. Encryption converts data to an unintelligible form, ciphertext; decrypting the ciphertext converts the data back into its original form. The AES algorithm is capable of using cryptographic keys of 128, 192, and 256 bits to encrypt and decrypt data in blocks of 128 buts.", "publisher": null, "date": "November 2001", "url": "https://web.archive.org/web/20030406010431/http://www.csrc.nist.gov/publications/fips/fips197/fips-197.pdf", "authors": ["NIST"], "tags": ["2000s", "AES", "Encryption Standards", "NIST"], "slug": "federal-information-processing-standards-fips-197-d91011f8"}, {"title": "American Cryptology During the Cold War, 1945-1989; Book 1: the Struggle for Centralization 1945-1960", "abstract": "American Cryptology During the Cold War, 1945-1989 is the first two books in a four book series written by Thomas R. Johnson of the NSA’s Center for Cryptological History detailing the U.S. government’s use of cryptology.  It begins by describing post-WWII cryptology to the end of the Nixon administration. This series seeks to describe events relevant to the development of the field, focusing on themes of “expansion and centralization.”", "publisher": "National Security Agency; Central Security Service", "date": "1995", "url": "https://web.archive.org/web/20090228051551/http://www.nsa.gov/public_info/_files/cryptologic_histories/cold_war_i.pdf", "authors": ["Johnson, Thomas R."], "tags": ["1940s-1980s", "CIA", "Cold War", "NSA"], "slug": "american-cryptology-during-the-cold-war-1945-1989-4c53fc9a"}, {"title": "A Roadmap for Exceptional Access Research", "abstract": "Mayank Varia, Research Associate Professor of Computer Science at Boston University and Co-Director of BU’s Center for Reliable Information Systems and Cyber Security, warns of the “dour consequences” of continued politicization in the “crypto wars” debate over End-to-End (E2E) and Exceptional Access (EA) encryption systems. In an effort to quell continued politicization, Varia proposes a four-step roadmap to inform the process of developing EA technology and aid future policy debates. Varia’s proposal includes: (1) a comprehensive review of the benefits and risks of an EA encryption system (from a policy viewpoint; (2) a skeletal definition of the security guarantees that EA encryption should provide (in order to mitigate policy risks); (3) a list of several possible capabilities that an EA system might provide in an attempt to identify a minimum viable product together with law enforcement; and (4) a call to construct policy to revive research in to EA’s technology challenges (an area that has been “mostly dormant” for two decades.This essay is part of a series of essays from the Crypto 2018 Workshop on Encryption and Surveillance.", "publisher": "Lawfare", "date": "December 2018", "url": "https://www.lawfareblog.com/roadmap-exceptional-access-research", "authors": ["Varia, Mayank"], "tags": ["2010s", "Crypto Wars", "Exceptional Access"], "slug": "a-roadmap-for-exceptional-access-research-9b867071"}, {"title": "the  People  of  the  State  of  Colorado v. Shaun  R.  Davis", "abstract": "In Colorado v. Davis, the Colorado Supreme Court held that using a passcode given to police officers to execute a search warrant on a smartphone did not violate the Fourth Amendment. In this case, a criminal defendant had given his cellphone passcode to police officers during his arrest so they could call his girlfriend. Later, after law enforcement received a warrant to search the phone, the passcode was used to search the phone. The court reasoned that the defendant did not have a reasonable expectation of privacy in his passcode once he disclosed it to the police officers.", "publisher": null, "date": "April 2019", "url": null, "authors": [], "tags": ["2010s", "Amendment IV", "Case Law", "Criminal Law", "Passcode", "Searches and Seizures"], "slug": "the-people-of-the-state-of-colorado-v-shaun-r-davi-ca69bf48"}, {"title": "Congress, Not the Attorney General, Should Decide the Future of Encryption", "abstract": "Alan Z. Rozenshtein, Associate Professor of Law at the University of Minnesota Law School, warns of the dangers of forgoing end-to-end encryption, an anticipated consequence of the powers granted to the attorney general, in the circulating draft of the EARN IT Act. Rozenshtein argues, “the question of whether to permit ubiquitous encryption is the sort of high-level policy decision that is best handled not by the executive branch but by Congress,” recommends against the legislature “shirk[ing] its responsibility to make this tough decision,” and, in the context of the Act, calls for the exclusion of anything encryption-related from the list of best practices. \n\nThe EARN IT Act was first introduced, by Senator Lindsay Graham, to Congress on March 5, 2020, considered by the Senate Judiciary Committee on June 25, 2020, cleared committee and was placed on the Legislative Calendar on July 20, 2020. The Act has been a source of considerable concern for its encryption-related consequences.", "publisher": "Lawfare", "date": "February 2020", "url": "https://www.lawfareblog.com/congress-not-attorney-general-should-decide-future-encryption", "authors": ["Rozenshtein, Alan Z."], "tags": ["2020s", "End-to-End Encryption", "Going Dark", "Section 230", "US Congress"], "slug": "congress-not-the-attorney-general-should-decide-th-61477972"}, {"title": "Memorandum for the Heads of Executive Departments and Agencies: Policy to Require Secure Connections Across Federal Websites and Web Services", "abstract": null, "publisher": "Executive Office of the President, Office of Management and Budget", "date": "June 2015", "url": null, "authors": ["Scott, Tony"], "tags": ["2010s", "HTTPS", "Obama"], "slug": "memorandum-for-the-heads-of-executive-departments-beed0dbf"}, {"title": "Status Report on the First Round of the NIST Post-Quantum Cryptography Standardization Process", "abstract": "The National Institute of Standards and Technology is in the process of selecting one or more public-key cryptographic algorithms through a public competition-like process. The new publickey cryptography standards will specify one or more additional digital signature, public-key encryption, and key-establishment algorithms to augment FIPS 186-4, Digital Signature Standard (DSS), as well as special publications SP 800-56A Revision 2, Recommendation for Pair-Wise Key Establishment Schemes Using Discrete Logarithm Cryptography, and SP 800-56B, Recommendation for Pair-Wise Key-Establishment Schemes Using Integer Factorization. It is intended that these algorithms will be capable of protecting sensitive information well into the foreseeable future, including after the advent of quantum computers.", "publisher": null, "date": "January 2019", "url": "https://nvlpubs.nist.gov/nistpubs/ir/2019/NIST.IR.8240.pdf", "authors": ["Alagic, Gorjan and Alperin-Sheriff, Jacob and Apon, Daniel and Cooper, David and Dang, Quynh and Liu, Yi-Kai and Miller, Carl and Moody, Dustin and Peralta, Rene and Perlner, Ray and Robinson, Angela and Smith-Tone, Daniel"], "tags": ["2010s", "NIST", "Public Key Encryption", "Quantum Resistant", "Quantum Safe"], "slug": "status-report-on-the-first-round-of-the-nist-post-579fe6e3"}, {"title": "Canada's Quiet Weakening of Communications Encryption", "abstract": "This article outlines some of the federal government of Canada’s successful and unsuccessful attempts to weaken encryption standards.", "publisher": "the Citizen Lab", "date": "August 2015", "url": "https://citizenlab.ca/2015/08/canadas-quiet-history-of-weakening-communications-encryption/", "authors": ["Parsons, Christopher and Israel, Tamir"], "tags": ["2010s", "Canada"], "slug": "canada-s-quiet-weakening-of-communications-encrypt-c6650006"}, {"title": "Coalition Letter to President Obama 5/19/2015", "abstract": "We urge you to reject any proposal that U.S. companies deliberately weaken the security of their products. We request that the White House instead focus on developing policies that will promote rather than undermine the wide adoption of strong encryption technology. Such policies will in turn help to promote and protect cybersecurity, economic growth, and human rights, both here and abroad.", "publisher": null, "date": "May 2015", "url": "https://static.newamerica.org/attachments/3138--113/Encryption_Letter_to_Obama_final_051915.pdf", "authors": [], "tags": ["2010s", "Backdoors", "Economic Impact", "Human Rights", "National Security"], "slug": "coalition-letter-to-president-obama-5-19-2015-ad5d54f2"}, {"title": "Open Letter to Mark Zuckerberg: Facebook's End-to-End Security Plans", "abstract": "Letter in support of end-to-end encryption from 112 signatory groups/associations.", "publisher": null, "date": "October 2019", "url": "https://cdt.org/insights/open-letter-facebooks-end-to-end-encryption-plans/", "authors": [], "tags": ["2010s", "End-to-End Encryption", "Facebook", "Privacy Rights"], "slug": "open-letter-to-mark-zuckerberg-facebook-s-end-to-e-81bc1514"}, {"title": "Open Letter to Mark Zuckerberg: Facebook's \"Privacy First\" Proposals", "abstract": "From US, UK, Australia objecting to implementation of end-to-end encryption without ensuring \"there is no reduction in user safety and without including a means for lawful access to the content of communications to protect our citizens.\"", "publisher": null, "date": "November 2019", "url": null, "authors": ["Patel, Priti and Barr, William and McAleenan, Kevin K. and Dutton, Peter"], "tags": ["2010s", "Facebook", "Privacy Rights"], "slug": "open-letter-to-mark-zuckerberg-facebook-s-privacy-ac79aa39"}, {"title": "Complete ACM Columns Collection", "abstract": "Coming Into The Country\nPrivate Life in Cyberspace\nThe Great Work\nDecrypting the Puzzle Palace\nWill Japan Jack In?\nBill O' Rights Lite\nA Plaintext On Crypto\nDad's Invisible Shield\nDeath from Above", "publisher": "Electronic Frontier Foundation", "date": null, "url": "https://www.eff.org/pages/complete-acm-columns-collection", "authors": [], "tags": ["1990s", "Crypto Wars", "Crypto Wars I"], "slug": "complete-acm-columns-collection-9f722ce3"}, {"title": "Encryption under fire: discussion on threats to private messaging w/ Head of WhatsApp Will Cathcart", "abstract": null, "publisher": null, "date": "July 2020", "url": "https://www.youtube.com/watch?v=Y1LSFQo_07w", "authors": [], "tags": ["2010s", "Amendment I", "Crypto Summit", "Cyber Attacks", "Data Breaches", "Domestic Concerns", "Foreign Concerns", "Personal Privacy", "Primer", "Terrorism"], "slug": "encryption-under-fire-discussion-on-threats-to-pri-6bbe4ed7"}, {"title": "Entropy and Random Numbers", "abstract": "Sectigo SSL Certificates formerly Comodo CA SSL Certificates. Same high quality SSL certificates you trust! Money Back Guarantee. Secure all Subdomains. 30 Day Refund Policy, 24/7 Live Support", "publisher": null, "date": null, "url": "https://sectigo.com/resources/root-causes-1-25", "authors": ["Callan, Tim and Soroko, Jason"], "tags": ["2010s", "Primer"], "slug": "entropy-and-random-numbers-d61c00fb"}, {"title": "Russia Wants to Make an Example of Telegram", "abstract": "The messaging app is under direct attack from Russian domestic intelligence. The real target may be Facebook and Twitter.", "publisher": "Bloomberg Opinion", "date": "September 2017", "url": "https://www.bloomberg.com/opinion/articles/2017-09-28/russia-wants-to-make-an-example-of-telegram", "authors": ["Bershidsky, Leonid"], "tags": ["2010s", "Intelligence", "Mobile", "RUS"], "slug": "russia-wants-to-make-an-example-of-telegram-7aa97786"}, {"title": "Secret US Cybersecurity Report: Encryption Vital to Protect Private Data", "abstract": "Newly uncovered Snowden document contrasts with British PM’s vow to crack down on encrypted messaging after Paris attacks", "publisher": "The Guardian", "date": "January 2015", "url": "https://www.theguardian.com/us-news/2015/jan/15/-sp-secret-us-cybersecurity-report-encryption-protect-data-cameron-paris-attacks", "authors": ["Ball, James"], "tags": ["2010s", "GCHQ", "NSA", "National Security", "Snowden", "Surveillance", "The NSA files", "UK News", "UK Security and Counter-Terrorism", "World News"], "slug": "secret-us-cybersecurity-report-encryption-vital-to-9703fda8"}, {"title": "Shining a Light on the Encryption Debate: A Canadian Field Guide", "abstract": null, "publisher": null, "date": "May 2018", "url": null, "authors": ["Gill, Lex and Parsons, Christopher and Israel, Tamir"], "tags": ["2010s", "Canada"], "slug": "shining-a-light-on-the-encryption-debate-a-canadia-9d78aca2"}, {"title": "Standards Setting and Federal Information Policy: The Escrowed Encryption Standard (EES)", "abstract": "The controversial Escrowed Encryption Standard, recently adopted as a Federal Information Processing Standard (FIPS), has polarized some stakeholders both within and outside government and has also raised disturbing questions about the role of Federal agencies in the standards-setting process. This article explores the relationship between standards and Federal information policy and examines the balance between national security and law enforcement concerns, on the one hand, and privacy rights and U.S. economic competitiveness, on the other.", "publisher": "Government Information Quarterly", "date": "January 1994", "url": "http://www.sciencedirect.com/science/article/pii/0740624X94900183", "authors": ["Gegner, Karen E. and Veeder, Stacy B."], "tags": ["1990s", "Crypto Wars", "Crypto Wars I", "Encryption Standards"], "slug": "standards-setting-and-federal-information-policy-t-0fafb4ad"}, {"title": "Statement by Commerce Secretary William Daley Re: Administration encryption policy", "abstract": null, "publisher": "Department of Commerce", "date": "September 1999", "url": "http://www.techlawjournal.com/cong106/encrypt/19990916dal.htm", "authors": ["Daley, William M."], "tags": ["1990s", "Clinton", "Crypto Wars", "Crypto Wars I", "Government Policy", "White House"], "slug": "statement-by-commerce-secretary-william-daley-re-a-f1d56237"}, {"title": "Key Escrow", "abstract": null, "publisher": "Electronic Privacy Information Center, epic.org", "date": "April 1998", "url": "https://epic.org/crypto/key_escrow/", "authors": [], "tags": ["1990s", "Crypto Wars", "Crypto Wars I", "EPIC"], "slug": "key-escrow-880e03ca"}, {"title": "The Metaphor is the Key: Cryptography, The Clipper Chip, and the Constitution", "abstract": null, "publisher": "University of Chicago Legal Forum", "date": "1996", "url": "http://osaka.law.miami.edu/~froomkin/articles/clipper.htm", "authors": ["Froomkin, Michael A."], "tags": ["1990s", "Clipper Chip", "Crypto Wars", "Crypto Wars I", "Key Escrow"], "slug": "the-metaphor-is-the-key-cryptography-the-clipper-c-9a3caf0b"}, {"title": "The Role of Encryption in Australia", "abstract": "Encryption is essential to Australia’s modern\ndigital society, economy, and cyber security,\nand it is only effective if it is strong and robust.\n\nStrong encryption serves Australia’s national\ninterests by protecting governments,\ncommunities, and the economy from criminal,\nterrorist, and state-sponsored attacks.\n\nEncryption will only become more important for\nprotecting Australian interests as technology\nadvances in the coming decades.\n\nThe government is proposing to weaken encryption\nin the name of fighting terrorism, however this policy\nwould create more security risks than it addresses.\n\nThere are other policy options for dealing with\nterrorist use of digital technology that are more\nurgent and effective than weakening encryption.", "publisher": null, "date": "January 2018", "url": "https://www.accessnow.org/cms/assets/uploads/2018/01/Crypto-Australia-Memo.pdf", "authors": ["O'Shea, Lizzie and Thomas, Elise"], "tags": ["2010s", "Access Now", "Australia"], "slug": "the-role-of-encryption-in-australia-4e0f543e"}, {"title": "Statement by the Press Secretary", "abstract": "Statement on the Clipper Chip", "publisher": "the White House, Office of the Press Secretary", "date": "April 1993", "url": "https://epic.org/crypto/clipper/white_house_statement_4_93.html", "authors": [], "tags": ["1990s", "Clinton", "Crypto Wars", "Crypto Wars I", "White House"], "slug": "statement-by-the-press-secretary-617ea86a"}, {"title": "Why An Encryption Backdoor for Just the \"Good Guys\" Won't Work", "abstract": "Recently, U.S. law enforcement officials have re-energized their push for a technical means to bypass encryption. But seeking to undermine encryption only looks backward instead of focusing on where technology is going. We should be having conversations about new investigative techniques, not trying to preserve the access enjoyed in the days before encryption was so widespread, particularly when so much is at stake in doing so.", "publisher": "Just Security", "date": "March 2018", "url": "https://www.justsecurity.org/53316/criminalize-security-criminals-secure/", "authors": ["Stepanovich, Amie and Karanicolas, Michael"], "tags": ["2010s", "Backdoors", "Global"], "slug": "why-an-encryption-backdoor-for-just-the-good-guys-918a9e9d"}, {"title": "S. 266 - Comprehensive Counter-Terrorism Act of 1991", "abstract": "Text for S.266 - 102nd Congress (1991-1992): Comprehensive Counter-Terrorism Act of 1991", "publisher": null, "date": "January 1991", "url": "https://www.congress.gov/bill/102nd-congress/senate-bill/266/text", "authors": ["Biden, Joseph"], "tags": ["1990s", "Backdoors", "Government Access", "US Congress"], "slug": "s-266-comprehensive-counter-terrorism-act-of-1991-780b290c"}, {"title": "S.1842 - Protecting Personal Health Data Act", "abstract": "To protect the personal health data of all Americans.", "publisher": null, "date": "June 2019", "url": "https://www.congress.gov/bill/116th-congress/senate-bill/1842/text", "authors": ["Klobuchar, Amy and Murkowski, Lisa"], "tags": ["2010s", "Bill", "Encryption Standards", "Healthcare", "Policy", "Protecting Personal Health Data Act", "US Congress"], "slug": "s-1842-protecting-personal-health-data-act-8bffdbe7"}, {"title": "S. 1336 - Data Breach Prevention and Compensation Act of 2019", "abstract": "To create an Office of Cybersecurity at the Federal Trade Commission for supervision of data security at consumer reporting agencies, to require the promulgation of regulations establishing standards for effective cybersecurity at consumer reporting agencies, to impose penalties on credit reporting agencies for cybersecurity breaches that put sensitive consumer data at risk, and for other purposes.", "publisher": null, "date": "May 2019", "url": "https://www.congress.gov/bill/116th-congress/senate-bill/1336/text", "authors": ["Warren, Elizabeth and Warner"], "tags": ["2010s", "Bill", "Data Breach Prevention and Compensation Act of 2019", "Federal Trade Commission", "Office of Cybersecurity", "US Congress"], "slug": "s-1336-data-breach-prevention-and-compensation-act-e1fa535f"}, {"title": "S. 2889 - National Security and Personal Data Protection Act of 2019", "abstract": "To safeguard data of Americans from foreign governments that pose risks to national security by imposing data security requirements and strengthening review of foreign investments, and for other purposes.", "publisher": null, "date": "November 2019", "url": null, "authors": ["Hawley, Josh and Cotton, Tom and Rubio, Marco"], "tags": ["2010s", "Bill", "Cybersecurity", "Foreign", "Investment", "National Security and Personal Data Protection Act of 2019", "Security Requirements", "US Congress"], "slug": "s-2889-national-security-and-personal-data-protect-a7b6e85d"}, {"title": "Clinton Administration Encryption Policy Statement \\\\& Press Briefing", "abstract": null, "publisher": null, "date": "September 1998", "url": "https://congressional.proquest.com/congressional", "authors": [], "tags": ["1990s", "Clinton", "Crypto Wars", "Crypto Wars I", "Export Controls", "Law Enforcement", "Security", "White House"], "slug": "clinton-administration-encryption-policy-statement-cdde72d2"}, {"title": "Report of the Attorney General's Cyber Digital Task Force", "abstract": "In February of 2018, the Attorney General established a Cyber-Digital Task force within the U.S. Department of Justice and tasked it with answer two foundational questions. First, “how is the Department responding to cyber threats?” Second, “how can federal law enforcement more effectively accomplish its mission in this important and rapidly evolving area?” This Report addresses the first question. The Report begins with a focus on malign foreign influence operations, before expanding into a discussion of other cyber-enabled threats. The Report then explores the FBIs role in responding to cyber incidents and the Department of Justice’s efforts to recruit and train personnel on cyber matters, before concluding with a chapter on priority policy matters.", "publisher": null, "date": "July 2018", "url": null, "authors": [], "tags": ["2010s", "Department of Justice", "Going Dark", "Law Enforcement"], "slug": "report-of-the-attorney-general-s-cyber-digital-tas-7bcf0590"}, {"title": "Recommendation of the Council Concerning Guidelines for Cryptography Policy (adopted by the Council at its 895th session on 27 March 1997 [C/M(97)6/PROV])", "abstract": null, "publisher": "Organisation for Economic Co-operation and Development (OECD)", "date": "May 1997", "url": "https://one.oecd.org/document/C(97)62/FINAL/en/pdf", "authors": [], "tags": ["1990s", "Cold War", "International", "Organisation for Economic Cooperation and Development", "Wassenar Arrangement"], "slug": "recommendation-of-the-council-concerning-guideline-8821d5fd"}, {"title": "Secrets or Shields to Share? New Dilemmas for Dual Use Technology Development and the Quest for military and Commercial Advantage in the Digital Age", "abstract": null, "publisher": "UC Berkeley", "date": "February 2003", "url": null, "authors": ["Stowsky, Jay"], "tags": ["1990s", "2000s", "Dual-Use Technology", "Economic Impact", "National Security", "Primer"], "slug": "secrets-or-shields-to-share-new-dilemmas-for-dual-34d6ebbe"}, {"title": "Request for Comments: Revisions to Encryption Items", "abstract": null, "publisher": "Bureau of Export Administration, U.S. Department of Commerce", "date": "January 2000", "url": null, "authors": ["Lewis, James A."], "tags": ["2000s", "Crypto Wars", "Crypto Wars I", "Export Controls"], "slug": "request-for-comments-revisions-to-encryption-items-0c68d1bf"}, {"title": "Statement of General Keith B. Alexander, Commander, United States Cyber Command, Before the Senate Committee on Armed Services", "abstract": null, "publisher": null, "date": "March 2013", "url": null, "authors": ["Alexander, Keith B."], "tags": ["2010s", "Cyber Command", "Law Enforcement", "National Security"], "slug": "statement-of-general-keith-b-alexander-commander-u-d467327a"}, {"title": "In Re: Application for an Order Pursuant to 18 U.S.C. 2705(b) Relating to a Subpoena to Open Whisper Systems for the Accounts Listed", "abstract": null, "publisher": null, "date": "September 2016", "url": "https://signal.org/bigbrother/eastern-virginia-grand-jury/", "authors": [], "tags": ["2010s", "Case Law"], "slug": "in-re-application-for-an-order-pursuant-to-18-u-s-f42df79e"}, {"title": "Surveillance Costs: The NSA's Impact on the Economy, Internet Freedom \\\\& Cybersecurity", "abstract": "It has been over a year since The Guardian reported the first story on the National Security Agency’s surveillance programs based on the leaks from former NSA contractor Edward Snowden, yet the national conversation remains largely mired in a simplistic debate over the tradeoffs between national security and individual privacy. It is time to start weighing the overall costs and benefits more broadly. While intelligence officials have vigorously defended the merits of the NSA programs, they have offered little hard evidence to prove their value—and some of the initial analysis actually suggests that the benefits of these programs are dubious. Three different studies—from the President’s Review Group on Intelligence and Communications Technologies, the Privacy and Civil Liberties Oversight Board, and the New America Foundation’s International Security Program—question the value of bulk collection programs in stopping terrorist plots and enhancing national security. Meanwhile, there has been little sustained discussion of the costs of the NSA programs beyond their impact on privacy and liberty, and in particular, how they affect the U.S. economy, American foreign policy, and the security of the Internet as a whole.\n\nThis paper attempts to quantify and categorize the costs of the NSA surveillance programs since the initial leaks were reported in June 2013. Our findings indicate that the NSA’s actions have already begun to, and will continue to, cause significant damage to the interests of the United States and the global Internet community.", "publisher": null, "date": "July 2014", "url": "https://www.newamerica.org/oti/policy-papers/surveillance-costs-the-nsas-impact-on-the-economy-internet-freedom-cybersecurity/", "authors": ["Kehl, Danielle and Bankston, Kevin and Greene, Robyn and Morgus, Robert"], "tags": ["2010s", "Cybersecurity", "Economic Impact", "Government Access", "National Security", "OTI", "Personal Privacy"], "slug": "surveillance-costs-the-nsa-s-impact-on-the-economy-5c789458"}, {"title": "Security vs. Security - Rapid7 Supports Strong Encryption", "abstract": "A major area of focus in the current cybersecurity policy discussion is how growing adoption of encryption impacts law enforcement and national security, and whether new policies should be developed in response. This post briefly evaluates several potential outcomes of the debate, and provides Rapid7's current position on each.  Background", "publisher": "Rapid7", "date": "April 2016", "url": "https://blog.rapid7.com/2016/04/01/security-vs-security-rapid7-supports-strong-encryption/", "authors": ["Geiger, Harley"], "tags": ["2010s", "National Security"], "slug": "security-vs-security-rapid7-supports-strong-encryp-4634f37f"}, {"title": "Senator Backs Off Backdoors", "abstract": "A senator changes his mind after calling for a prohibition on data-scrambling products without backdoors for government surveillance. Now, he \"has no intentions\" of working on such an encryption bill. Declan McCullagh reports from Washington.", "publisher": "Wired", "date": "October 2001", "url": "https://www.wired.com/2001/10/senator-backs-off-backdoors/", "authors": ["McCullagh, Declan"], "tags": ["2000s", "Backdoors", "Crypto Wars", "Crypto Wars II", "US Congress"], "slug": "senator-backs-off-backdoors-b6e3901e"}, {"title": "Revealed: How US and UK Spy Agencies Defeat Internet Privacy and Security", "abstract": "• NSA and GCHQ unlock encryption used to protect emails, banking and medical records• \\$250m-a-year US program works covertly with tech companies to insert weaknesses into products• Security experts say programs 'undermine the fabric of the internet'", "publisher": "The Guardian", "date": "September 2013", "url": "https://www.theguardian.com/world/2013/sep/05/nsa-gchq-encryption-codes-security", "authors": ["Ball, James and Borger, Julian and Greenwald, Glenn"], "tags": ["2010s", "Data and Computer Security", "GCHQ", "Intelligence", "NSA", "Surveillance", "The NSA files", "UK News", "World News"], "slug": "revealed-how-us-and-uk-spy-agencies-defeat-interne-6703184c"}, {"title": "Report on Post-Quantum Cryptography", "abstract": "In recent years, there has been a substantial amount of research on quantum computers –machines that exploit quantum mechanical phenomena to solve mathematical problems that are difficult or intractable for conventional computers. If large-scale quantum computers are ever built, they will be able to break many of the public-key cryptosystems currently in use. This would seriously compromise the confidentiality and integrity of digital communications on the Internet and elsewhere. The goal of post-quantum cryptography (also called quantum-resistant cryptography) is to develop cryptographic systems that are secure against both quantum and classical computers, and can interoperate with existing communications protocols and networks. This Internal Report shares the National Institute of Standards and Technology (NIST)’s current understanding about the status of quantum computing and post-quantum cryptography, and outlines NIST’s initial plan to move forward in this space. The report also recognizes the challenge of moving to new cryptographic infrastructures and therefore emphasizes the need for agencies to focus on crypto agility.", "publisher": null, "date": "April 2016", "url": "https://nvlpubs.nist.gov/nistpubs/ir/2016/NIST.IR.8105.pdf", "authors": ["Lily Chen", "Stephen Jordan", "Yi-Kai Liu", "Dustin Moody", "Rene Peralta", "Ray Perlner", "Daniel Smith-Tone"], "tags": ["2010s", "NIST", "Quantum"], "slug": "report-on-post-quantum-cryptography-ee42092b"}, {"title": "Old Technopanic in New iBottles", "abstract": "If we aim to preserve an “equilibrium” between government power and citizen privacy, we should accept that it will occasionally close one as well.", "publisher": "Cato Institute", "date": "September 2014", "url": "https://www.cato.org/blog/old-technopanic-new-ibottles", "authors": ["Julian Sanchez"], "tags": ["2010s", "Backdoors", "Foreign Concerns", "Mobile"], "slug": "old-technopanic-in-new-ibottles-50857d54"}, {"title": "NSA Isn’t the Going Dark Solution, Part II: There’s No Such Thing As Magic", "abstract": "In Part I of this series, I noted the tendency of commentators—without any actual knowledge—to assert that NSA could simply break into a given locked iPhone.", "publisher": "Lawfare", "date": "March 2016", "url": "https://www.lawfareblog.com/nsa-isnt-going-dark-solution-part-ii-theres-no-such-thing-magic", "authors": ["Susan Hennessey"], "tags": ["2010s", "Going Dark", "Law Enforcement", "NSA"], "slug": "nsa-isnt-the-going-dark-solution-part-ii-theres-no-9863433f"}, {"title": "NSA Isn’t the Going Dark Solution, Part I: Richard Clarke Gets It Wrong", "abstract": "Let’s start with a point that will be significant emotional satisfaction to many readers: Richard Clarke was dead wrong. In a remarkable statement last week, the former Clinton and early Bush administration counterterrorism official told NPR’s Morning Edition:", "publisher": "Lawfare", "date": "March 2016", "url": "https://www.lawfareblog.com/nsa-isnt-going-dark-solution-part-i-richard-clarke-gets-it-wrong", "authors": ["Susan Hennessey"], "tags": ["2010s", "Going Dark", "Law Enforcement", "NSA"], "slug": "nsa-isnt-the-going-dark-solution-part-i-richard-cl-976df318"}, {"title": "US Encryption Export Regualtion: US to EU: Me Too!  — The United States Amends Its Export Controls on Encrption, Responding to Recent Developments in the European Union", "abstract": "This paper reviews the most recent changes to the US export controls on encryption items (referred to herein as the “US Regulations”) that were published in the US Federal Register on 19 October, 2000.1165 Fed. Reg. 62600 (2000). It describes how the decision by the European Union (EU) Council of Ministers on 22 June 2000, to create a license free zone for exports of encryption (and other) items (referred to herein as the “EU Regulations”) provided the initial stimulus for these changes. It also describes how the US Regulations fall short of matching the EU Regulations in some respects, while exceeding the EU Regulations in other respects. In addition, the authors offer recommendations for further reforms to the US encryption export control policy that might be addressed by the next administration in Washington. They conclude on a cautionary note, considering the possibility that the recent reforms to US encryption export control policy could be reversed in the future.", "publisher": "Computer Law \\& Security Review", "date": "January 2001", "url": "http://www.sciencedirect.com/science/article/pii/S0267364901001030", "authors": ["Thomsen II, Roszel C and Paytas, Antoinette D"], "tags": ["2000s", "Export Controls", "Law Enforcement"], "slug": "us-encryption-export-regualtion-us-to-eu-me-too-th-169deed5"}, {"title": "First and Fifth Amendment Challenges to Export Controls on Encryption: Bernstein and Karn", "abstract": null, "publisher": "Santa Clara Law Review", "date": "1996", "url": "https://heinonline.org/HOL/P?h=hein.journals/saclr37&i=177", "authors": ["Pilkington, Laura M."], "tags": ["1990s", "Clinton", "Export Controls", "Law Enforcement", "National Security"], "slug": "first-and-fifth-amendment-challenges-to-export-con-41c9888c"}, {"title": "New Perspectives on the Future of Encryption", "abstract": "Encryption and its effects on law enforcement’s access to data seem to occupy a perennial place in the headlines (and on Lawfare as well). The two of us have been working on it for years. The subject is often highly contested, but the fierce discussion has ignored some critical factors. One of those is how changing usage patterns and technologies will affect how law enforcement can—or can’t—obtain access.", "publisher": "Lawfare", "date": "May 2019", "url": "https://www.lawfareblog.com/new-perspectives-future-encryption", "authors": ["Baker, Jim and Landau, Susan"], "tags": ["2010s", "Academic", "Think Tank", "User-Controller Encryption"], "slug": "new-perspectives-on-the-future-of-encryption-29240979"}]